[
    {
    "id": "13",
    "state": "South Eastern Nigeria",
    "name": "Banga Soup (Ofe Akwu)",
    "description": "Banga Soup is also referred to as Ofe Akwu where Ofe means Soup / Stew and Akwu means palm fruit and is used mainly as stew for Boiled White Rice.The palm fruit oil extract used in cooking Banga Soup / Stew is quite different from the red palm oil used in cooking Nigerian food recipes.Palm Oil is pure oil extracted from the palm fruit pulp at high temperatures while the palm fruit oil extract used for the Banga Soup is extracted at a very low temperature and is a mixture of oil and water. Palm fruit oil extracted for Banga Soup contains less saturated fat than palm oils.",
    "ingredients": "1. 1 kg Palm Fruits, 2. Beef, 3. Dry Fish, 4. Vegetable: Scent Leaves for Ofe Akwu or pumpkin leaves or any other vegetable in place of scent leaves. 5. 2 medium onions, 6. 2 tablespoons ground crayfish, 7. Salt and Chilli Pepper (to taste), 8. Locust beans, 9. 1-2 big stock cubes",
    "steps": "1. Extract the palm fruit concentrate from the palm fruits. 2. Cook the beef and the dry fish with 1 bulb of diced onion and the stock cubes till done, 3. Wash and cut the scent leaves into tiny pieces. 4. The scent leaves give the Banga Stew (Ofe Akwu) its unique aroma and taste, 5. Cut the remaining bulb of onion, 6. Pound the crayfish, ogiri okpei and pepper in a mortar and set aside. You can also grind them with a dry mill. 7. Set the pot of palm fruit extract on the stove and start cooking at high heat, 8. Leave to boil till you notice come red oil at the surface of the Banga Stew, 9. If you think that the Banga Soup is watery, 10. Cook till the soup has thickened to the consistency you like for your stews, 11. Now, add the beef, dry fish and stock, the onions, crayfish and pepper and leave to boil very well. 11. Add the scent leaves or other vegetable and salt to taste. 12. Leave to simmer for about 2 mins and the Banga Soup is done. 13 Serve with White Rice",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843566/bang-her-soup.jpg",
    "videoLink": "https://youtu.be/FWF4R_5BzyQ"
  },
  {
    "id": "14",
    "state": "South East Nigeria",
    "name": "Moi Moi",
    "description": "Moi moi, also known as steamed bean pudding is made with either brown Beans, black eyed beans or lentils",
    "ingredients": "1. 750g Beans(Either brown or black eyed beans), Salt, 2. habanero pepper, 3. Crayfish, 4. 4 stock cubes(Nutmeg/maggi), 5. 2 teaspoons of ground nutmeg, 6. 2 medium onions, 7. 20cl vegetable oil, 8. 2 litres of warm water, 9. 3 tatashe peppers",
    "steps": "1. Cut the onions into smaller pieces and grind it. 2. Grind the crayfish with a dry mill. 3. Wash the tatashe  pepper. 4. Remove the tatashe seeds as they can give the mea a bitter taste. 5. Get Your beans which you should have soaked overnight and blend it(NOTE: Use a good blend for this step). 6. Blend the beans, tatashe, habanero pepper, onions, crayfish and your ground nutmeg together with some water and pour the mix into a pot. 7.  Add vegetable oil to your mix. 8. Slowly add water and stir the mixture at the same time till all the ingredients are perfectly mixed, 9. Add salt to taste and stir very well, 10. Pad the base of the pot. 11. Pour some water, the depth of the water should be at most 1 inch. 12. Dish the Moi moi mix into containers of your choice. 13. Add as small quantity of water as possible at a time while cooking the Moi Moi so that the moi moi will not become watery when done, Regardless of the container you use, so that the moi moi will not become watery when done.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843565/moi-moi.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "15",
    "state": "General",
    "name": "Onion Baked Chicken",
    "description": "This chicken recipe is a very easy recipe",
    "ingredients": "1. 1 small red onion, 2. 3 chicken quarters, 3. 2 small stock cubes, 4. 1 teaspoon Nigerian curry powder, 5. 1 teaspoon black pepper powder, 6. 1 teaspoon thyme",
    "steps": "1. Get a pot and add water, 2. Add your thyme,onions,stock cubes(Maggi or Knorr),curry powder, black pepper powder. 3. Add your Chickens and let it cook for about 20 mins. 4. Transfer your chickens to an oven and let it cook for  5 mins. 5. Your Onion baked chicken is ready",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591846312/onion-chicken.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "16",
    "state": "General",
    "name": "Barbecue Chicken Wings",
    "description": "This recipe is a  great evening and/or picnic snack. You can serve it at parties too.",
    "ingredients": "1. Chicken wings (wingettes and drumettes), 2. Onion powder, 3. Paprika powder, 4. Ginger powder, 5. Garlic powder, 6. Black pepper, 7. Pasley, 8. Cilantro, 9. Salt, 10. Sugar, 11. Corn flour, 12. Tomato powder, 13. Smoke flavour, 14. Caramelized sugar",
    "steps": "1. Clean and rinse the chicken wingettes and drumettes and put in a bowl. 2. Grind the remaining ingredients with a spice grinder. 3. Add the ground seasonings and herbs. 4. When you’ve got a good mix, cover and set aside to marinate for 30 minutes to 1 hour. 5. Spread them out in a baking tray. 6. Bake in the oven for 45 to 50 minutes turning them around at half time. 7. Congrats! food is ready",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591846312/BBQ-Chicken-Wings.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "17",
    "state": "South Eastern Nigeria",
    "name": "Ofe Akwu (palm)",
    "description": "Banga Soup is also referred to as Ofe Akwu where Ofe means Soup / Stew and Akwu means palm fruit and is used mainly as stew for Boiled White Rice.The palm fruit oil extract used in cooking Banga Soup / Stew is quite different from the red palm oil used in cooking Nigerian food recipes.Palm Oil is pure oil extracted from the palm fruit pulp at high temperatures while the palm fruit oil extract used for the Banga Soup is extracted at a very low temperature and is a mixture of oil and water. Palm fruit oil extracted for Banga Soup contains less saturated fat than palm oils.",
    "ingredients": "1. 800g tinned Palm Fruit Concentrate, 2. Beef, 3. Dry Fish, 4. Vegetable: Scent Leaves for Ofe Akwu or bitter leaves for Delta-style, 5. 2 medium onions, 6. 2 tablespoons ground crayfish, 7. Salt and Chilli Pepper (to taste), 8. Locust beans, 9. 1-2 big stock cubes",
    "steps": "1. Open the Palm Fruit Concentrate tin and set aside. 2. Wash and cut the scent leaves into tiny pieces.The scent leaves give the Banga Stew (Ofe Akwu) its unique aroma and taste. 3. Cut the remaining bulb of onion. 4. Pound the crayfish, ogiri okpei and pepper in a mortar and set aside. You can also grind them with a dry mill. 5. Cook the beef and the dry fish with 1 bulb of diced onion and the stock cubes till done. 6. When the beef and fish are well don. 7. add the palm fruit concentrate. 8. Add water to get the consistency you like for your stews. 9. Leave to boil very well. 10. Add the onions, crayfish, pepper and ogiri blend and let it boil very well, 11. Add the scent leaves or other vegetable and salt to taste. 12. Leave to simmer for about 2 mins and the Banga Soup is done. 13. If you used bitter leaves to prepare it, serve with Nigerian morsel meals especially Starch. If you used scent leaves to prepare it, serve with boiled white rice.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843566/bang-her-soup.jpg",
    "videoLink": "https://youtu.be/FWF4R_5BzyQ"
  },

  {
    "id": "18",
    "state": "Southern Nigeria",
    "name": "White Moi Moi (Ekuru)",
    "description": "White Moi Moi (Ekuru) is another way to enjoy beans. With a little alteration, it is suitable for vegetarians. It is to regular Moi Moi what Agidi is to Agidi Jollof or what Boiled White Rice is to Jollof Rice. It is prepared the same way as regular Moi Moi but with less added ingredients. It gets most of its taste and colour from the stew it is served with. On its own, White Moi Moi is tasty due to the seasoning it contains so you can skip the stew and enjoy it with a chilled drink.",
    "ingredients": "1. 360g black eyed or brown beans for Four medium wraps of White Moi Moi, 2. 1 small onion, 3. big stock cube, 4. Salt (to taste), 5. 600mls lukewarm water, 6. 2 cooking spoons vegetable oil (optional), 7. 250mls Tomato Stew, 8. 2 small smoked mackerels, 9. 1 small onion, 10. 1 small stock cube, 11. Salt and Habanero pepper (to taste), 12. 1 teaspoon nutmeg",
    "steps": "1. About three hours before cooking the moi moi, soak and peel the beans. 2. When done with step 1, put the peeled beans in a bowl and pour enough water to cover it. 3. Leave to soak for three hours. This is so that the best consistency will be achieved when you blend the beans. 4. Prepare Tomato Stew if you do not have some. 5. Prepare the moi moi containers. You can use Aluminium foil or Plastic Bowls or Uma Leaves (Thaumatococcus Daniellii). 6. Prepare some Smoked Fish and break into big chunks. 7. Pound/grind the pepper. 8. Cut the onions into small pieces. 9. Crush the stock cubes. 10. Blend the beans with the onions and crushed stock cubes and pour into a big enough bowl. 11. Please note that the total quantity of water to be used (for blending and mixing) should be 600 mls. 12. Add the vegetable oil (if using it) and stir. 13. Slowly add the remaining water and stir the mixture at the same time till you get a good mix of all the ingredients. 14. Add salt to taste and stir very well. 15. Set some water in a pot to boil. The water should be about 1 cm deep. 16. When the water boils, add some padding that will be a base for the Moi Moi wraps. 17. Scoop the Moi Moi mix into your container of choice and gently place in the pot of boiling water. 18. Repeat step 7 for the rest of the Moi Moi mix. 19. When done, cover the wraps with some leaves or a plastic bag to keep the heat in. 20. Cover the pot and start cooking on medium heat. 21. Cook your Moi Moi for at least 45 minutes(Advised), before checking it. 22. Check it from time to time and add small quantities of water at a time when necessary.The length of time you will cook your Moi Moi depends on the quantity and the Moi Moi container you used. The Moi Moi that gets done quickest is the one wrapped in Uma leaves, followed by Moi Moi wrapped in aluminum foils then the one that takes the most time is Moi Moi cooked in aluminium or plastic plates. 23. Confirm that it is done by putting a knife through it, if the knife is stained with Moi Moi paste, then the Moi Moi is not done, but if the knife just has a slight smear of Moi Moi, then it's done. 24. You can eat white Moi Moi with any tomato based stew, make sure the stew is seasoned with at least one traditional ingredients: smoked fish, iru, crayfish. *You can prepare yours by taking the following steps, it'll be so delicious. 1. Put the chunks of fish in a clean pot. 2. Add the onions, some water, stock cube, pepper and nutmeg. 3. Stir and start cooking. 4. Once it boils, add the tomato stew. 5. Cover and leave to simmer and it’s done! 6. Serve with the stew or skip the stew and serve the White Moi Moi with a chilled soft drink.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591965671/ekuru-white-moi-moi.jpg",
    "videoLink": "https://youtu.be/2rr-ESPYOwA"
  },
  
  {
    "id": "43",
    "state": "South Eastern Nigeria",
    "name": "Oha Soup",
    "description": "Oha soup is native to the Southern Eastern Nigeria.Oha soup is a traditional soup cooked with Ora leaves",
    "steps": "Grind the crayfish and pepper, Wash and boil the cocoyam corm till its soft, Remove the peels around the cocoyam, Use a Mortar and pestle to pound the corms to a smooth paste, With a knife cut the Ora leaves into tiny pieces, Get your stock fish and dry fish cut in smaller pieces, Boil your stock fish and dry fish in  1 litre of water till they are done, Wash and cut your meat then add to the pot and continue cooking, When the meat is done, add 2 stock cubes and cook for 5 minutes, Add pepper,group crayfish and ogiri, let it cook for another 10 minutes, While the cooking add the cocoyam paste in small lumps, When your done adding the small lumps, then add palm oil, Let it cock until all the cocoyam lumps have dissolved. (NOTE : you can add more water if you feel the soup is too thick, Add the Ora leaves, Add salt to your taste, cook for about 5 minutes, The soup is ready",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843588/oha-soup.jpg",
    "videoLink": "url of video"
  }
]