[
    {
    "id": "31",
    "state": "South West Nigeria",
    "name": "Ewa Agoyin",
    "description": "This dish was brought across the border from Benin Republic by the Aganyin people (Yoruba speaking) into the southwest. Ewa agoyin are specially prepared beans, cooked until the grains cling fluffily to one another, creating a melting sensation on the tongue. The kicker is the specially prepared stew it is eaten with. Ewa agoyin is usually eaten with hot agege loaves.",
    "ingredients": " (1) 2 cigar cups (approx. 500g) brown/black eyed beans. (2) 5 cooking spoons red palm oil. (3) 5 big plum tomatoes, 1 handful crayfish. (4) 1 big onion, Pepper & Salt (to taste),(5) 2 stock cubes",
    "steps": "(1) Soak the beans in cold water for 5 hours. (2) Boil the beans for 5 minutes and discard the water. (3) Rinse the beans in cold water and set aside. (4) This soaking and pre-cooking process will help reduce the gas inducing elements. (5) Chop the onions, grind the crayfish and pound the pepper. (6) Blend the tomatoes and boil the tomato puree till all the water has dried from it. (7) Pre-cook the diced onions without any added water. (8) The aim is to get it to caramelize a bit so that it will take less time to fully caramelize during frying. (9) Cook the beans till done. For Ewa Agoyin, the beans needs to be very soft. (10) When the beans is done, add salt, leave to dry up all the water and set aside. (11) To cook the Agoyin, pour the palm oil into a separate dry pot. (12) Allow to heat up till the oil starts smoking and the red colour changes to clear. (13) It is better to do this at medium heat so that the oil does not get too hot too quickly. (14) Remember to turn off your smoke alarm before doing this. (15) To keep the smoke to a minimum and still have the traditional taste of Ewa Agoyin, I use vegetable oil and when it is very hot, I add a small amount of palm oil. (16) Watch the video below to see how I do that. (17) Now add the precooked onions and stir continuously till the onions is fully caramelized. (18) It should be very dark in colour. (19) Add the parboiled tomato puree and stir continuously till you cannot tell the difference between the tomatoes and onions. (20) Add the pepper, crayfish, stock cubes and salt to taste. You can also add a little water at this point if your want. (21) Stir very well and bring to the boil. The Ewa Agoyin is ready!",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591963340/ewa-agoyin.jpg",
    "videoLink": "https://youtu.be/jQ_pgHgwyZM"
  },
  {
    "id": "32",
    "state": "South West Nigeria",
    "name": "Pounded yam",
    "description": "Yams that have been crushed or stirred to a creamy, dough-like consistency. Pounded yams are considered a fufu (a kind of starchy side dish) usually served with a stew or efo.",
    "ingredients": " (1) Yam (2) Water",
    "steps": "(1) You simply cook white yam and pound the yam pieces with a mortar and pestle when done. Sounds easy, doesn't it?",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591963331/pounded-yam.jpg",
    "videoLink": "https://youtu.be/_OcV_0C8G-g"
  },
  {
    "id": "33",
    "state": "General",
    "name": "Egusi Soup",
    "description": "A stew usually made with crayfish or other meat and thickened with ground melon seeds (egusi). This soup gets its name from protein-rich egusi that lends the dish its velvety, creamy texture and rich flavor. Egusi is satisfying on its own. It is a staple in most West African home and it is an uncomplicated one pot meal that is often accompanied with swallows like Eba, Amala, Semovita, Pounded yam, Fufu, and the likes.",
    "ingredients": " (1) 2 Cups Melon (2) 1 Cup Palm Oil (3) 4 Tablespoon Crayfish (4) 3 Tablespoon locust beans (5) 24 oz chopped spinach (6) 1 Red Bell Pepper (7) 1 Habanero Pepper (8) 1 Fresh Pepper, 2 Onions, Stock Cube (9) 1 lb Beef, Salt To Taste, 3 cups Beef stock",
    "steps": "(1) Blend the peppers and Onions together until smooth and set aside. (2) Blend the Egusi melon, half of the second Onion, and Crayfish together. (3) Set aside as well. Heat the Palm Oil in a pan and allow it to melt over medium heat but don't overheat the Oil. (4) Add the remaining half onion (diced) and half of the Locust bean. (5) Let it cook for about 3 minutes on medium heat. (6) Add the blended pepper and cook till the water is reduced this should take about 15 minutes on medium heat until the water is reduced stirring about every 5 minutes to prevent burning. (7) Add the remaining locust bean, Beef stock, and salt to taste. Cover and leave to cook for another 5 minutes. (8) Gently introduce the blended Egusi inside the sauce but don't stir it at this point. (9) Just cover it and leave it to cook for about 20 to 30 minutes Keep an eye on it so it doesn't burn but try not to stir it until the Egusi turns into a soft compact mass. (10) Then, gently stir together and add more stock or water if necessary. (11) Add the Fish and meat and leave to cook again for another 5 minutes. (12) Stir in the Spinach and leave to simmer for about 5 minutes (stir constantly). (13) Adjust the seasoning if necessary. Serve while still hot.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591963340/egusi-soup.jpg",
    "videoLink": "https://youtu.be/LqGj3_UT9h8"
  },
  {
    "id": "34",
    "state": "South West Nigeria",
    "name": "Àmàlà",
    "description": "Àmàlà is a local indigenous Nigerian food, native to the Yoruba tribe in the South-western parts of the country. It is made out of yam and/or cassava flour, or unripe plantain flour. Yams are peeled, sliced, cleaned, dried and then blended into a flour, also called elubo. Yams are white in colour but turn brown when dried. This gives àmàlà its colour. Àmàlà is from Western Africa and eaten mostly by the Yoruba people in Nigeria. Amala is mainly consumed by indigenous people of the Southwestern part of Nigeria.[4] It could be served with a variety of ọbẹ (soups), such as ẹfọ, ilá, ewédú, ogbono or gbegiri (black-eyed beans soup). There are three types of amala; Yam flour (amala isu), Cassava flour (amala lafun), Plantain flour (amala ogede)",
    "ingredients": " (1) Water (2) One of the different types of flour, some more",
    "steps": "(1) The only ingredients needed when making àmàlà is boiling water and one of the desired types of flour. (2) Once the water has come to a boil, the heat is reduced. (3) The flour is added and stirred until all the water is absorbed. (4) More hot water is added, then the dough is left to simmer for approximately five minutes. (5) Then the dough is kneaded until it has the desired texture. (6) Kneading the dough into a smooth paste is the most difficult part of making àmàlà",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591963365/amala.jpg",
    "videoLink": "https://www.youtube.com/watch?v=HpiVPxCNuYo"
  },
  {
    "id": "35",
    "state": "Enugu, Nigeria",
    "name": "Echicha Ede",
    "description": "Ẹchịcha (also, Achịcha) is a dish native to the Igbo part of Nigeria consisting mainly of dried Cocoyam, mgbụmgbụ (Pigeon pea), and palm oil. It is traditionally eaten in the dry season when fresh vegetables are hard to come by. It is one of the most traditional meals in Igboland.",
    "ingredients": " (1) cups achicha ede (cocoyam flakes) (2) Pigeon pea (3) Crayfish, Seasoning cubes (4) ½ cup red palm oil, ụgba (seed of the oil bean tree) (5) 600g green leafy vegetables, Scent leaves (nchanwu, efirin) (6) Red Onion, Fresh Pepper, Salt (to taste)",
    "steps": "Ẹchịcha is made by steaming the dried cocoyam and mgbụmgbụ until they are soft, then mixing the two thoroughly with a sauce made of palm oil, ụgba (seed of the oil bean tree), onions, fresh pepper, and salt.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591963355/achicha-ede.jpg",
    "videoLink": "https://youtu.be/VK2LC0trtEY"
  },
  {
    "id": "36",
    "state": "Cross River, Nigeria",
    "name": "Edikang Ikong",
    "description": "Edikang Ikong is a vegetable soup that originated among the Efik- Ibibio people of Akwa Ibom State and Cross River State in Southeastern Nigeria. It is considered to be a delicacy among some Nigerians, and is sometimes served during occasions of importance. Edikang Ikong is a very nutritious soup and is expensive to prepare, and has been described as being mostly eaten by rich people in Nigeria.",
    "ingredients": " (1) Beef, dried fish, bushmeat, crayfish, shaki (cow tripe). (2) pumpkin leaves, ugu, onion, periwinkle, palm oil, salt, pepper",
    "steps": "(1) Wash and cut the pumpkin and water leaves into tiny pieces. (2) Put them in separate sieves to drain out all the water as much as possible. (3) Cut the Kanda into small pieces. (4) Cook the beef, kanda and the dry fish with the 2 bulbs of diced onions and the stock cubes with as little quantity of water as possible. (5) When the meat is done, add a generous amount of palm oil, the crayfish and pepper and leave to boil for about 10 minutes. (6) The palm oil serves as the liquid in the Edikang Ikong soup. (7) You should try as much as possible to make it the only liquid in the soup. (8) Add the periwinkle and water leaves and leave to cook for another 5 minutes. (9) You may have to cook for less time at this stage so that the water leaves are not over-cooked. (10) Now add the pumpkin leaves and salt to taste. (11) Stir the contents of the pot very well and turn off the heat. (12) Cover the pot and leave to stand for about 5 minutes.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591963355/edika-ikong.jpg",
    "videoLink": "https://youtu.be/B3X4gxPnikU"
  },
  {
    "id": "37",
    "state": "General",
    "name": "Nigerian Jollof Rice",
    "description": "This is a very rich and versatile  one-pot Meal. The Nigerian rice recipe discussed here is the classic Nigerian Jollof Rice served at parties. This is a very popular Nigeria rice recipe.",
    "ingredients": " (1) 750g long grain parboiled rice. (2) 2-3 cups Tomato Stew, (3) Pepper and salt (Add to taste). (4) 2 medium onions, 3 Knorr cubes, 2 teaspoons thyme. (5) 2 teaspoons curry powder (Nigerian curry powder)",
    "steps": "(1) Prepare the tomato stew, Parboil the rice. (2) Rinse the parboiled rice and put in a sieve to drain. (3) Pour the tomato stew into a sizeable pot and leave to boil. (4) Add the drained parboiled rice, curry powder, salt(Add to taste) and pepper(Add to taste) to the pot. (5) Then add water, the water level should be the same level of the rice. (6) This is to ensure that all the water dries up by the time the rice is cooked. (7) Cover the pot and let it cook on low to medium heat. (8) This way the rice does not burn before the water dries up. (9) By the time the water is dry the rice should be done. (10) Taste To confirm,if you would need to add more water and reduce the heat to prevent burning. (11) Keep cooking, still it's done.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843568/jollof.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "38",
    "state": "Eastern Nigeria",
    "name": "Ofe Nsala (Nsala Soup)",
    "description": "Ofe Nsala is the quickest and easiest Igbo Soup to prepare making it the choice soup for special guests who are so familiar to us that they pay us impromptu visits.",
    "ingredients": " (1) 1 big Catfish (Catfish is the fish for Ofe Nsala). (2) White yam. (3) 5 Utazi leaves, Small piece of ogiri okpei (4) A handful crayfish, Habanero pepper (to taste). (5) Salt (if necessary), 1 big bulb of red onion, 2 seasoning cubes",
    "steps": " (1) Boil hot water and pour on the pieces of fish to remove the slime on the fish as well as toughen them. (2) You want to toughen the catfish so it does not disintegrate in the soup. (3) Quickly rinse off the slime with cool water and place the fish in the cooking pot. (4) Peel the yam and cut into medium pieces. (4) Chop the utazi and pound in a mortar (or blend in a blender) with the pepper, ogiri okpei and crayfish. Just give them a rough pound. (5) Same with if you are using a blender. (6) Add the seasoning cubes (crushed) to the pot of fish. (7) Add the pieces of yam, then pour water to cover everything and start cooking. (8) When the yam is soft and moist, bring them out and place in a mortar. (9) Add the pounded crayfish, pepper, ogiri okpei and utazi into the pot of fish and continue cooking (10) Pound the cooked yam in a mortar till smooth and stretchy. (11) Add the yam into the pot of Ofe Nsala in small lumps, cover and continue cooking. (12) Once the yam dissolves and thickens the soup, it is done. (13) If you achieve medium consistency before all the yam is dissolved, take out the undissolved yam because you do not want the Ofe Nsala to be too thick. (14) Add salt if necessary, stir very well and that’s it, Serve with Pounded Yam, Semolina or Fufu.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843585/ofe-nsala.png",
    "videoLink": "https://youtu.be/FB7d7WoRlwk"
  },
  {
    "id": "39",
    "state": "South East Nigeria",
    "name": "Nkwobi",
    "description": "Nkwobi is a delicacy that is usually ordered at exclusive restaurants. It's simply cooked cow foot mixed with spicy palm oil paste",
    "ingredients": "(1) 2kg(4.4 lbs) of cow foot , which would be cut into sizeable pieces. (2) 20cl(200ml) of Palm Oil. (3) 1 tablespoon of powdered edible potash. (4) 1 teaspoon ground Ehu seeds( Calabash nutmeg). (5) 1 sizable onion, 2 habanero pepper or you can add it to your taste. (6) Salt( to taste). (7) To garnish: 1 medium onion and 10 utazi leaves",
    "steps": "(1) Cut the cow foot into medium chunks. (2) Put the powdered potash into a bowl with small water and stir well. pass it through a sieve and set the liquid aside, Cut 1 onion into 4 big chunks, Pound the pepper with a mortar and pestle, Grind the crayfish, Crack and remove the outer shell of the ehu and grind it with a dry mill (e.g coffee grinder), Wash and put the cow foot chunks in a pot, Add the stock cubes(Maggi/Knorr)  and the chunks of onion, All a little water and start cooking still it's well cocked. Add just enough water to prevent burning as you cock. There should not be any stock (water) in the pot when the cow foot chunks are done, While the meat is cooking , pour the palm oil into a clean dry pot, Pour the potash mixture that has already then sieved into the oil, Stir with a spatula as you pour the potash. The palm oil will begin to curdle and turn yellow, Add the ground crayfish, ehu seeds and pepper. Stir very well till they are all incorporated, When the meat is done , add sait , stir and cock till all the water has dried up, Add the well done cow foot to the palm oil paste and stir it very well, Cock until the Nkwobi is hot, stir it all the time to make sure it does not burn, To prepare the garnish, cut the onions into rings and cut the utazi into long thin slices, Add the onion rings and thin slices of utazi on top of the Nkwobi. Your Nkwobi is ready!",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843546/sisi-nkwobi.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "40",
    "state": "Edo, Nigeria",
    "name": "Owo Soup",
    "description": "You haven't been to Edo state if you've not tried their traditional owo soup. It is the oldest prepared and eaten soup of the edo people. It is usually thick and bare compared to other Nigerian soups. To prepare this delicious delicacy, the following ingredients are required.",
    "ingredients": "(1) Dried or smoked fish, Goat meat or assorted meat, (2) Cray fish, 1 handful of dried prawns. (3) Fresh or dried pepper, potash, 1 onion bulb, 5 fresh tomatoes. (4) 1 seasoning cube, salt",
    "steps": "(1) Wash and add the meat to a pot. (2) Add the chopped onion, seasoning cube and salt to taste. (3) Allow to boil for 3 minutes. (4) Add the smoked fish, blended tomatoes, pepper and crayfish into the pot. (5) Allow this to boil for 10 minutes, Stir continuously to avoid burning. (6) Add the potash into a bowl of boiling water to dissolve. (7) Strain and carefully add the liquid into the pot. Leave to cook for a few minutes. (8) Add the palm oil and allow to cook then stir. Note that the addition of the potash is what gives the soup it's thickness. (9) Finally, serve with any swallow of your choice.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843588/owo-soup.jpg",
    "videoLink": "https://youtu.be/txx_GTJWf0A"
  },
  {
    "id": "41",
    "state": "General",
    "name": "Special Okra Soup",
    "description": "This Okra Soup recipe is the most concentrated Okra Soup ever. It is meant for only licking! Yes, we say you lick the soup when we “eat” just the soup. That means no need for a fufu meal. The soup is that conc, with lots of vitamins. This is best for those who want to reduce or maintain their weight.",
    "ingredients": "(1) 500g okra, 1.2kg beef, 2 medium smoked mackerels (titus fish). (2) 1 sweet pepper, 10 mushrooms(optional). (3) ¼ cup palm oil, Leafy vegetable (ugu or spinach). (4) 1 big bulb of red onion, 2 seasoning cubes",
    "steps": "(1) Debone the fish and break them up into big chunks. (2) Rinse and prep the okra by hand-cutting it. (3) Chop the peppers, Slice up the mushrooms (if available). (4) Chop the onions, Boil the beef with seasoning cubes (crushed) and half of the chopped onions. (5) When done, set the stock aside. The stock should be little by the time the beef is well done. (6) In a clean dry pot, fry the sliced mushrooms with the palm oil. (7) Fry for at most 5 minutes, Take out the mushrooms, Stir-fry the diced okra and remaining onions in the oil for a bit. (8) Do not over-fry, Start adding the meat stock bit by bit. (9) Add, stir till you notice the elasticity of the okra coming through. (10) Repeat till all the stock is used up. (11) Add the rest of the ingredients into the pot with the leafy vegetable on top.(12) Cover and steam till the leafy vegetables at the top wilts from the heat. (13) Stir till everything is well combined then add salt to your taste and mix well. (14) The Okra Soup should be VERY thick when done.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843582/okro-soup.jpg",
    "videoLink": "https://youtu.be/g-FoiBNDVg8"
  },
  {
    "id": "42",
    "state": "General",
    "name": "stir-fry chicken spaghetti", 
    "description": " Just when you thought spaghetti couldn't get any better, it did. This dish is finger-licking good and would have you coming back for more. So if you're thinking of spicing up your meal plan, you should definitely add this to the list.",
    "ingredients": "(1) Boiled and drain chicken, vegetable oil, (2) 1 bulb of onion, Thyme and curry powder, sliced green and red bell peppers, 2 each, 1 seasoning cube, A pack of thin spaghetti, Salt to taste",
    "steps": "(1) Add oil into a pan and allow to heat up. (2) Add chopped onion into the hot oil. (3) Stir and Add the blended peppers, Add thyme and curry powder. (4) Stir and add the sliced garlic and ginger. (5) Cover and allow to dry, when it is dried, empty it into a bowl. (6) In the same pan, add your already boiled chicken, season and stir fry until it is well cooked, while the chicken is stir-frying, add water into a pot. (7) Add salt to this boiling water. Add spaghetti to the boiling water and allow to cook. Add the vegetable(pepper) into the pan containing the chicken. (8) Add half a seasoning cube and mix together, Drain the cooked spaghetti and add it into the stir-fry mixture. (9) Stir together properly, put off the heat and get ready to have a mouth watering meal",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591846315/spaghetti.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "43",
    "state": "South Eastern Nigeria",
    "name": "Oha Soup",
    "description": "Oha soup is native to the Southern Eastern Nigeria.Oha soup is a traditional soup cooked with Ora leaves",
    "ingredients":" (1) Crayfish (2) Pepper (3) Cocoyam corm (4) Ora leaf (5) Fish and Stockfish (6) Seasoning (7) Ogiri",
    "steps": " (1) Grind the crayfish and pepper, Wash and boil the cocoyam corm till its soft. (2) Remove the peels around the cocoyam, Use a Mortar and pestle to pound the corms to a smooth paste. (3) With a knife cut the Ora leaves into tiny pieces, Get your stock fish and dry fish cut in smaller pieces. (4) Boil your stock fish and dry fish in  1 litre of water till they are done. (5) Wash and cut your meat then add to the pot and continue cooking. (6) When the meat is done, add 2 stock cubes and cook for 5 minutes (7) Add pepper, group crayfish and ogiri, let it cook for another 10 minutes. (8) While the cooking add the cocoyam paste in small lumps. (9) When your done adding the small lumps, then add palm oil, Let it cock until all the cocoyam lumps have dissolved. (NOTE : you can add more water if you feel the soup is too thick) (10) Add the Ora leaves, Add salt to your taste, cook for about 5 minutes, The soup is ready",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843588/oha-soup.jpg",
    "videoLink": "url of video"
  }
]
