[
   {    "id": "19",
    "state": "General",
    "name": "Zobo drink",
    "description": "Zobo is a Nigerian beverage made from dried Roselle plant flowers. The drink is also known as Roselle drink and called Sorrel drink in the Carribean.",
    "ingredients": "1. dry zobo leaves, 2. 2 cups of dry Zobo leaves, 3. 1 glove of garlic, 4. 1 big piece of ginger, 5. 1 big very ripe pineapple, 6. 5 litres of water, some more citrus fruits of choice e.g orange, lemon, lime.",
    "steps": "1. Get a chiffon bag for seiving, 2. Unpack the Zobo leaves into a container, 3. Rinse the Zobo to get rid of dirts, 4. Wash peel and cut the pineapple into thin slices, 5. Rinse the ginger, 6. cloves and iyere one after the other, 7. Add the iyere and cloves to the zobo, 8. Pour it inside the chiffon bag, tie the bag and place it inside a deep pot of more than 5 litres volume capacity, 9. Peel and cut the ginger and garlic into tiny pieces, 10. Add the pineapples and pour enough water to cover the contents of the pot and then some, 11. Start cooking at medium to high heat and let it boil for 5 minutes, 12. Add the ginger and the garlic, add more water and keep boiling for at least 30 minutes. 13. This is the time it will take for the zobo leaves to be completely soft and the pineapples tender., 14. Turn off the heat and set aside to cool down completely, When cool, wringe out the juice from the pineapples and zobo leaves, leaving only the zobo juice in the pot, Pour the juice through a sieve to take out the remaining large particles then pour it through a chiffon cloth to remove the tiniest particles, Add any artificial flavours of your choice at this time and stir, Pour into bottles and refrigerate, Serve with ice and sliced fruits. Enjoy it on a hot sunny day with any Nigerian snack.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591846317/zobo-drink.jpg",
    "videoLink": "https://youtu.be/9ORwEUlFPZ0"
  },

  {
    "id": "20",
    "state": "General",
    "name": "Peppered Chicken",
    "description": "This recipe is a great snack to server it at parties too",
    "ingredients": "1. 2 tatashe peppers, 2. Salt (to taste), 3. 1 tablespoon thyme, 4. 1.2kg chicken, 5. 2 Scotch bonnet peppers or habanero peppers, 6. 2 onions, 7. 1 cooking spoon vegetable oil, 8. 6 small stock cubes",
    "steps": "1. Cut one of the onions into tiny pieces and cut the other into thin slices., 2. Remove the seeds from the tatashe pepper and cut them   into small pieces, blend with a hand blender., 3. Rinse and clean the chicken.Cut them into desirable sizes, 4.Place the chickens in a bowl and add the thyme, diced onions and stock cubes (crushed), 5.Massage the seasoning and spices into the chicken with your hands, cover and put in the fridge to marinate for at least an hour, 6.When the chicken has marinated for 1 hour, place in a pot, pour some water and start cooking, if your using a pressure cooker, 7.If your using a normal pot, just start cooking and by the time it starts to boil, water will seep out from the chicken, 8.When the chicken is done, take them out and grill/broil in the oven at 180°C (350F), 8.Pour the vegetable oil in a dry pot and heat it up, Add the pepper blend and start frying on low to medium heat till all the water dries up, 9.Add the grilled/broiled peppered chicken and stir very well, till the popping red peppers have coated every inch of the chicken, 10.You can add salt if necessary, Congrat! You're done.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843581/peppered-chicken.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "21",
    "state": "General",
    "name": "Tomatoes stew",
    "description": " The easiest and most popular stew to make is the tomato stew. Easy steps and ingredients make up this beautiful dish. ",
    "ingredients": "1.Fresh tomatoes, 2.Chicken or any protein of your choice, 3.vegetable oil, 4.scotch bonnets, 5.1 bulb of onion, 6.Garlic and ginger, 7.2 seasoning cube and salt to taste, 8.Pumpkin leaf(optional)",
    "steps": "1.Blend tomatoes,pepper and half an onion together, 2.season the chicken with 1 seasoning cube and salt, 3.Put into a pot of boiling water and allow to cook, 4.while your chicken is cooking, add oil into a pan and allow to heat up, chop the remaining half of the onion and add it into the hot oil, 5.When the onion is golden brown, add the already blended tomato, stir and cover, 6.By the time the stew is frying, the chicken should have been ready, 7.Drain the chicken, fry on another pan(this is optional) and set aside, 8.Add a little chicken stock to the stew when it is dried, 9.Stir and cover, If you decide to use vegetables, chop them up and add into the stew. Stir and cover again, 10.Add the fried chicken, stir and allow to sit for 3 minutes, 11.Turn the heat off and serve with rice or yam or whatever you like,",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843575/tomato-stew.jpg",
    "videoLink": "https://youtu.be/709tecOPYYI"
  },
  {
    "id": "22",
    "state": "South west Nigeria",
    "name": "Asun (Goat Meat BBQ)",
    "description": "Asun is a traditionally made food. It is made of goat meat.",
    "ingredients": "1. 1.2kg(2.6lbs) goat meat, 2. 2 habanero pepper, 3. 2 medium onion, 4. 1 teaspoon thyme, seasoning cubes of choice, curry powder and salt, 5. vegetable oil, 1 small green bell pepper and 1 small red bell pepper",
    "steps": "1. cut the goat meat with the skin into big chunks, 2. wash and put in a bowl. Add thyme and other seasoning ingredients of your choice, 3. Massage the ingredients into the meat and leave to marinate for 1-2hours, 4. Blitz the habanero pepper and set aside. put the marinated meat into to pressure cooker so it cooks faster, 5. slice 1 onion into big chunks and add it to the meat. Add little water and allow to cook, 6. when the goat is well done, remove the chunk of onions. Drain the meat and set aside, 7. lay the meat flat on your oven rack and grill at 180°c till it is brown all over. This should take a maximum of 15 minutes, 8. while the meat is grilling, wash and cut the green and red bell peppers and the remaining onion. Thread them on toothpicks, when the meat is well grilled, heat the vegetable oil in a pot. 9. Add the pounded habanero and a little of the goat meat stock. Fry for a bit and add the goat meat, stir for a bit and add the grilled meat. 10. Stir till the pepper is absorbed by the meat, Empty the meat into a bowl lined  with  paper towel. And that's it, you can serve with the threaded toothpicks",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591963339/nigerian-asun.jpg",
    "videoLink": "https://youtu.be/jcUeJs4PyK8"
  },
  {
    "id": "23",
    "state": "South East Nigeria",
    "name": "Abacha (African salad)",
    "description": "Abacha, also  known as African Salad, is a highly nutritious delicacy native to the Igbos in the South-Eastern part of Nigeria. It is normally served at Igbo traditional gatherings and also be enjoyed as a dessert, appetizer or a full meal.",
    "ingredients": "1. 2 tablespoons Powdered Potash, 2. 1 large Onion, Salt and dry pepper ( Add to taste), 4. 4 tablespoons ground crayfish, 5. 2 stock cubes (Maggi/Knorr), 6. 1 teaspoon ground Ehu seeds (Calabash Nutmeg), 7. 30 cl red palm oil, 8. 2 cups ugba (ukpaka), 9. 2 to 3 handfuls abacha, 10. 1 teaspoon Tru/Ogiri, 11. 3 Fresh Utazi leaves (Gongronema latifolium), 12. Garden Egg leaves, 12. Garden Eggs (As much as you want), 13. 1 medium onion (for serving)",
    "steps": "1. Prepare the ehu seeds by roasting, 2. peeling and grinding them with a dry mill, 3. Wash and cut the vegetables into tiny pieces, 4. Cut the big bulb of onion into tiny pieces and cut the medium one in circles, 5. Wash the garden eggs and set aside, there is no need to cut these, 6.Grind the crayfish and pepper, 7.Soak the Abacha in cold water. Once the Abacha has softened, 8.put in a sieve to drain, 9.Rinse the Ugba with lukewarm water, 10.Put the powdered potash in a bowl and pour about 1 cup of cold water, then stir well, 11.Pour the palm oil into a sizeable pot, 12.Pour the water from the potash mixture in the pot, make sure not to pour the sediments, 13.Stir very well and you'll see the oil turn into a yellow paste, 14. Add the ground pepper, ground ehu, crushed stock cubes (Maggi/knorr), crayfish, diced onions and ugba (ukpaka), then stir very well, 15. Add the iru/ogiri and make sure it is mixed very well, 16. Add the diced kanda/pomo and stir very well, 17.Now add the soaked and drained Abacha and stir till it mixes well in the palm oil paste, 18.Add the sliced Utazi and salt (to taste) and stir well. It is important that you add salt last because after adding all the seasoning, 19.your Abacha may not even need salt any more., 20.Abacha can be either served cold or warm. if you like yours warm, transfer to a gas cooker or stove and heat it up to your desired temperature, 21.When done, turn off the heat and add the sliced garden egg leaves , stir very well and serve, If you like your Abacha cold, just add the sliced garden egg leaves, stir very well and serve",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843546/sisi-nkwobi.jpg",
    "videoLink": "url of video"
  },

  {
    "id": "24",
    "state": "General",
    "name": "Unripe Plantain Porridge",
    "description": "This recipe is cooked with unripe plantains which  are known to be rich in iron. The recipe is fast and easy",
    "ingredients": "1. A big bunch of Nigerian pumpkin leaves, 2. 3 unripe plantains, 3. 1 medium fish (Mackerel), 4. 1-2 teaspoons ground crayfish, 5. 2 medium onions, 6. Red palm Oil(enough to colour the mea), Pepper and Salt (Add to taste), 7. 2 big stock cubes",
    "steps": "1. Wash, peel and cut up the plantain into smaller pieces with a knife, 2. Rinse and cut the pumpkin leaves into small pieces, 3. Wash, cut the fish into smaller pieces and remove the fish intestines, 4. Grind the crayfish and pepper, 5. Put the cut plantain in a pot, 6. Pur the chopped onions, stock cubes, fish, ground crayfish and pepper in the pot, 7. Add water to the same level as the contents of the pot, 8. Cook till the contents start to boil, 9. Add the red palm oil and salt to taste, 10.Cover the pot and keep cooking till done.This is when the plantain is tender to touch, 11. Add the vegetables, cover the pot and let it simmer, 12. Once it has heated up, stir, turn off the heat and leave it for at least five minutes before serving.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591846337/Plantain-porridge.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "25",
    "state": "Northern Nigerian",
    "name": "Tuwo Shinkafa",
    "description": "Tuwo Shinkafa is a northern Nigerian fufu recipe that is prepared with the soft rice variety. \nIt is usually served with Northern Nigerian soups: Miyan Kuka, Miyan Taushe etc. It also goes well with other Nigerian soups.\nThe rice used for Tuwo Shinkafa should be the a soft rice variety that becomes sticky when cooked. This is so that the grains can be easily mashed to make a mass of fufu (tuwo).",
    "ingredients": "1.Short/Medium grain soft rice, 2.Water (enough quantity to cook the rice till very soft and sticky)",
    "steps": "1.Rinse the rice in cold water and put in a sizeable pot., 2.Pour just enough water to cover the rice and start cooking at medium heat., 3.When the first dose of water dries up, 4.check the rice by mashing it between your fingers. If the rice grains have even a tiny resistance when you press them, then it needs to be cooked some more., 5.Reduce the heat to low, add a little bit more water and continue cooking till the water dries., 6.Repeat the process till the rice is so soft that it melts when you press on it., 7.Once you're happy, mash the rice with a wooden spatula by moving the rice in small quantities the far end of the pot to your side of the pot, 8.Fold the mound of tuwo and repeat till all the rice grains have turned into a mass of tuwo, Cover and leave it to steam for about 2 minutes, 9.Mix thoroughly and dish serving quantities onto a thin plastic film and wrap them up. This wrapping prevents the tuwo from drying up., 11.You can also serve them in smaller balls as shown in the image above, 12.Serve Tuwo Shinkafa with any Nigerian soup.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843581/peppered-chicken.jpg",
    "videoLink": "https://youtu.be/Zdjfq2RI51s"
  },
  {
    "id": "26",
    "state": "General",
    "name": "Coconut Rice",
    "description": "This combination of coconut,rice and spices is easy to prepare and can be served on its own or as part of main course",
    "ingredients": "1. 750g long grain parboiled rice, 2. 500mls Tomato Stew, 3. 600 mls of Coconut Milk, 4. Chilli pepper ( Add to taste), 5. Salt (Add to taste), 6. 1 medium onions, 7. 3 stock cubes, 8. 1 tablespoon thyme",
    "steps": "1. Prepare the tomato stew. 2. It is advisable to prepare tomato stew before hand. wash the chicken pieces and place them in a pot; add water till it covers the pieces of chicken, 3. Add the chopped onions, stock cubes(Maggi/knorr) and thyme, then start cooking, 4. Put the pieces of chicken in a sieve to drain, then fry with vegetable oil. You can also grill it in an oven. Parboil the rice, 5. Wash the parboiled rice and put in a sieve to drain, 6.Pour the chicken stock, coconut milk and the tomato stew into the pot, 7.Add the drained parboiled rice, salt and pepper to taste, 8.You may have to top up the water to bring the water level to the same level as the rice. This is to make sure that all the water dries up by the time the rice is cooked. Cover the pot and leave to cook, 9.Making sure to check what your cooking once in awhile so that the water doesn't dry up and the rice get burnt. Congrats ! your food is ready",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591963356/coconut-rice.jpg",
    "videoLink": "url of video"
  },
