[
  {
    "id": "1",
    "state": "South West Nigeria",
    "name": "Efo riro soup",
    "description": "Efo riro is one of the most popular vegetable soups in Nigeria and an absolute favorite of Yorubas. It is rich with vitamins and an amazing variety of protein.” To prepare this finger licking delicious delicacy, the following ingredients are needed;",
    "ingredients": "½ cup palm oil, scotch bonnet(Rodo), 3 medium bell, peppers(Tatashe), ½ medium size red onions, 2 bunch ugwu leaves, assorted meat of your choice, dried stockfish, ¼ cup smoked prawns, 1 tablespoon locust beans, 3 tablespoons ground crayfish, 2 seasoning cubes, salt to taste",
    "steps": "First you blend the bonnets, bell pepper and onion and set aside. Then you wash the vegetable with hot water and slice, Season the assorted meat in a pot and cook, Make sure to cook the touched meat first before the soft ones, Add palm oil into a big pot and allow to heat up. Add onion to the hot oil and stir,  Add the locust beans and stir for about 3 minutes. Add the blended pepper and let it dry for 15 minutes.  When a thick consistency is achieved,  add a little water and allow to cook for 2 minutes. Now add the already boiled meat and 1 seasoning cube. Taste and add salt if needed and finally add the vegetable. Stir thoroughly, switch of  the heat and serve with your favorite swallow.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843589/Efo-Riro.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "2",
    "state": "South East Nigeria",
    "name": "Onugbu Soup",
    "description": "This is a traditional soup native to the South Easten part of Nigeria",
    "ingredients": "A handful of washed and squeezed bitterleaf, 10 small corms(Cocoyam), 3 cooking spoons of Red Palm Oil, Assorted Beef( Optional ), Assorted Fish: Stock Fish and Dry Fish, Salt, Pepper and ground crayfish (to taste), 3 stock cubes( e.g maggi cubes), 1 teaspoon of Ogiri Igbo (traditional seasoning)",
    "steps": "Make sure the bitter leaves are well washed to remove the bitter taste. If the bitterness cannot be completely washed off, boil it for about 15 minutes and wash in cold water, Wash ad cock teh cocoyam till they are soft.Remove the peels and use a mortar and pestle to pound the cocoyams to a smooth paste, Boil the assorted beef, stock fish and dry fish in 1 litre of water till they are well done, Add the 3 stock cubes(Maggi/knorr) and cock for 5 minutes, Add the group crayfish, pepper and bitter leaves and cock for 10 minutes, Add the cocoyam paste in small lumps and the palm oil, Cover the pot and let it cock until the cocoyam lumps have dissolved. You can add water if you feel the soup is too thick, Add salt to taste and cock for a few minutes. The soup is ready",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843599/onugbu-soup.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "3",
    "state": "General",
    "name": "Akara",
    "description": "Akara is a popular Nigerian food made with beans and it is also known as bean cakes, bean balls or bean fritas. It can be served with pap,custard or fresh bread.",
    "ingredients": "1 cup black-eyed beans, 2 atarodo peppers, 1 medium onion, vegetable oil, salt to taste",
    "steps": "wash the beans thoroughly until the coat comes off and soak in water for 2 hours to make it soft enough to blend, Grind the beans in a blender and make sure to add just a little quantity of water, Heat up some oil at least 3 inches deep, Empty the ground beans into a deep bowl, Blend the pepper and onion separately and add it to the ground beans, mix properly and add one spoonful at a time into the hot oil, Fry until it is brown all over. Remove and place in a sieve lined with paper towels, Repeat this process until the mixture is the bowl is finished, your freshly made hot Akara is ready to be served as desired",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843527/akara.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "4",
    "state": "Northern Nigeria",
    "name": "Suya",
    "description": "Suya is an infamous spicy delicious street food that we all know and love. It is made either with beef, ram or chicken. Innards like kidney and liver are also used and the dried version of suya is called kilishi. Replicating this delicious goodness is really not a rocket science as the ingredients are readily available and affordable.",
    "ingredients": "500g boneless beef, 1/2 cup suya spice, 1/4 cup vegetable oil, 8-10 skewers, 1 seasoning cube",
    "steps": "soak skewers in water for 12hours so it doesn't burn during grilling, Wash meat thoroughly and slice into thin pieces, Loop the beef onto the skewers, Arrange the skewered meats in a deep dish or tray, Pour vegetable oil in a bowl, add seasoning cube and mix thoroughly, Dip a clean brush into the oil and thoroughly coat the meat with it, Dust the oiled meats with suya spice and make sure it covers the meat properly, Arrange the spice-covered meat on an oven rack and place them in a preheated grill or oven, Set the oven to 200 degrees Celsius and grill each side for 13-15 minutes, Enjoy your delicious homemade suya",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843528/suya.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "5",
    "state": "South East Nigeria",
    "name": "Ukwa (African Breadfruit)",
    "description": "Ukwa is also known as African breadfruit. It's a very versatile food. It can be roasted and eaten with coconut or palm kernel, it can be cooked plain without any ingredients. It can also be prepared as a porridge, we would be focusing on this",
    "ingredients": "2 medium dry fish, 2 small stock cubes, 7g edible potash, Palm oil(enough to change the color of your dish), 700g African Breadfruit, 5-6 fresh bitter leaves, Pepper & Salt",

    "steps": "if your using dry ukwa, soak it overnight in cold water. if Your using freah ukwa , skip this step, Soak, debone and wash the dry fish or stock fish and break it into smaller pieces, Wash the ukwa thoroughly in cold water. Stones and sand usually settle at the bottom, Pound the pepper, Rinse the bitter leaves and set it aside, Put the washed ukwa in a pot. Pour enough water to cover the ukwa. The level of water should be about 1 inch above the level of teh ukwa, Add the edible potash and the fry fish or stock fish, Cover th pot and cook till its done. The ukwa is done when the seeds melt when pressed. You may need to top up the water while cooking to avoid burning, Add enough palm oil to the  ukwa, add pepper , stock cubes and salt(to taste), Stir, cover and cook still the palm oil changes colour from read to yellow, Stir and add the bitter leaves, Cover and leave to simmer for about a minute. your ukwa is ready !",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591846320/ukwa-breadfruit.jpg",
    "videoLink": "url of video"
  },

  {
    "id": "6",
    "state": "General",
    "name": "Grilled Fish",
    "description": "This is a really tasty, economical and different way to enjoy fish! Lots of flavor from the marinade and easy clean up!",
    "ingredients": "Fish, Ground Red Pepper, Onions, Mixed Spices, Maggi, Vegetable Oil",
    "steps": "Wash and drain fish properly , Slit open slightly so mixed spices can penetrate, Marinate with mixed spices, oil, pepper, onions and maggi, Leave to rest for two hours or overnight in a refrigerator, Grill with a griller on medium heat until it's ready.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591846312/grilled-salmon.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "7",
    "state": "General",
    "name": "Puff Puff",
    "description": "Puff-puff is a traditional African snack made of fried dough.",
    "ingredients": "1kg Baker's Flour, 300g Sugar, Yeast, Flavour of choice, Lukewarm water, Vegetable oil for frying",
    "steps": "Mix flour and sugar, Pour lukewarm water in yeast, mix properly and add to already mixed dry ingredients, Add flavour, mix and leave to rise, Then fry in deep oil until golden brown",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591846306/puff-puff.jpg",
    "videoLink": "url of video"
  },

  {
    "id": "8",
    "state": "General",
    "name": "Doughnut",
    "description": "A doughnut or donut is a type of fried dough confection or dessert food. The doughnut is popular in many countries and is prepared in various forms as a sweet snack that can be homemade or purchased in bakeries, supermarkets, food stalls, and franchised specialty vendors.",
    "ingredients": "1 1/2 cups whole milk, lukewarm, 1 stick unsalted butter, room temperature, 4 1/2 teaspoons yeast, 3 large eggs, 1/4 cup + 2 tablespoons sugar, 1 1/2 teaspoons salt, 1 teaspoon freshly grated nutmeg, 5 cups + 1/4 cup + 2 tablespoons all-purpose flour, divide, Additional all-purpose flour for dusting, Vegetable oil for frying",
    "steps": "Combine first 7 ingredients and 2 cups flour in the bowl of your stand mixer. Beat on medium speed with a flat beater for 2-3 minutes (dough will look like slightly curdled cake batter)., Add remaining flour and switch to a dough hook, knead on medium speed for additional 3 minutes (dough will be very soft). Remove bowl from the mixer, scrape the sides of the bowl and cover bowl with a clean kitchen towel and place in the warmest spot in your kitchen. Let dough rise for 1 – 1 1/2 hours or until doubled in size., Dust working surface liberally with flour, Dump dough and dust flour on top. Roll into 1/2 inch thick circle, cut circles with 3-inch circle cookie cutter and with a small cookie cutter in the middle of each doughnuts, to make the holes., Place doughnuts on a lightly floured cookie sheet, spacing about an inch apart. Cover with a kitchen towel, let rise for about 30 to 45 minutes., Add about 2 inches of oil in a large Dutch oven, heat over medium high heat until 330 degrees. Deep fry about 4 doughnuts at a time, until golden brown on both sides (45-60 seconds per side). Drain on a paper towel.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591846310/Doughnut.jpg",
    "videoLink": "url of video"
  },

  {
    "id": "9",
    "state": "General",
    "name": "Moist Chocolate Cake",
    "description": "A Moist Chocolate Cake is a cake made with chocolate or cocoa.",
    "ingredients": "1/2 cup powdered sugar, 1 cup whole milk, 1 cup of flour, 1/4 cup of cocoa powder, 1tbs baking soda, 1/2 cupwater",
    "steps": "Mix powdered sugar in 1/2 cup of whole milk until smooth, Sift flour, cocoa powder and baking soda, Mix properly add the remaining 1/2 cup of whole milk mix properly, add water, Bake for 30mins",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591846304/moist-chocolate-cake.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "10",
    "state": "General",
    "name": "Strawberry Cake",
    "description": "Soft and fluffy homemade strawberry cake made with strawberries flavour and topped with a creamy strawberry buttercream",
    "ingredients": "500g Flour, 500g Flour, 500g butter, 500g fresh eggs, 1 tbs Baking powder, Strawberry flavour",
    "steps": "Sift cake flour into the mixer bowl, add sugar and butter, Add eggs bit by bit, Add flavor and baking powder mix properly for 7mins, Bake in preheated oven, in a well lined pan for 45mins",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591841044/Strawberry-Cake.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "11",
    "state": "General",
    "name": "Ofada Sauce",
    "description": "Ofada sauce is a delicious type of Nigerian stew that is usually eaten with ofada rice or any other food item.",
    "ingredients": "4 Green bell peppers, 1 large Onion, 2 Habanero pepper (Atarodo) - use as much as you want, 2 tbsp locust beans (iru), Beef Stock as needed, 2 tbsps Crayfish, 3/4 Cup Palm Oil, 4 boiled eggs, 1/2 pound Beef/Tripe cut into bit size, Salt to taste",
    "steps": "Blend the Peppers and Onions a little at a time adding very little water while blending because the excess water is not needed, Pour the blended Pepper into a Pot and boil it until most of the water is gone, In a clean Pot, add the Palm Oil, cover and let it heat up on low to medium heat until the color of the oil turns to honey-brown color, At this point, don't open the lid of the pot because of the intense smoke, just turn off the stove and leave it to cool or simply lift it outside for a faster cooling., Once the Oil is cooled down return to the stove top and let it heat up a little bit not to smoking point (uncovered this time), Add the diced Onions and locust bean and fry till the onions begin to float on the oil., Pour in the boiled pepper, stir it all together, cover it up and allow it to cook until the oil begins to float over the pepper sauce, Add your choice of Meat, some beef stock to loosen up the sauce if it's too thick and salt to taste.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843581/Ofada-Sauce.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "12",
    "state": "General",
    "name": "Potato stir-fry",
    "description": " Potatoes are incorporated into dishes differently. Of all the many methods of cooking potatoes, my personal favorite is the stir-fry.",
    "ingredients": "500g potatoes, 5 fillets of chicken breast, Green,red and yellow bell peppers, 1 red onion, Garlic and ginger, ½ teaspoon of thyme, salt, curry powder and onion powder, 2 tablespoons pepper sauce, 2 tablespoons soy sauce, vegetable oil",
    "steps": "cut the chicken into thin strips and put in a bowl, Add thyme, salt, onion powder and curry powder. Mix well, cover and set aside to marinate, cut the potatoes into long chips and deep fry, cut the belle peppers into long slices, peel and grate the garlic and ginger, Add vegetable oil into a frying pan and heat up. Fry the chicken strips and set aside, stir-fry the onion, garlic and ginger for 3 minutes. Add the bell peppers and fry for 5 minutes, Add the fried potato chips and mix thoroughly. Add pepper sauce and soy sauce., Mix everything together and turn off the heat, serve as you like, with a soft drink or water",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591846320/potato.jpg",
    "videoLink": "https://youtu.be/IsbiTKUSzYY"
  },
  {
    "id": "13",
    "state": "South Eastern Nigeria",
    "name": "Banga Soup (Ofe Akwu)",
    "description": "Banga Soup is also referred to as Ofe Akwu where Ofe means Soup / Stew and Akwu means palm fruit and is used mainly as stew for Boiled White Rice.The palm fruit oil extract used in cooking Banga Soup / Stew is quite different from the red palm oil used in cooking Nigerian food recipes.Palm Oil is pure oil extracted from the palm fruit pulp at high temperatures while the palm fruit oil extract used for the Banga Soup is extracted at a very low temperature and is a mixture of oil and water. Palm fruit oil extracted for Banga Soup contains less saturated fat than palm oils.",
    "ingredients": "1 kg Palm Fruits, Beef, Dry Fish, Vegetable: Scent Leaves for Ofe Akwu or pumpkin leaves or any other vegetable in place of scent leaves., 2 medium onions, 2 tablespoons ground crayfish, Salt and Chilli Pepper (to taste), Locust beans, 1-2 big stock cubes",
    "steps": "Extract the palm fruit concentrate from the palm fruits. If using the tinned palm fruit concentrate, open the tin and set aside, Cook the beef and the dry fish with 1 bulb of diced onion and the stock cubes till done, Wash and cut the scent leaves into tiny pieces. The scent leaves give the Banga Stew (Ofe Akwu) its unique aroma and taste, Cut the remaining bulb of onion, Pound the crayfish, ogiri okpei and pepper in a mortar and set aside. You can also grind them with a dry mill, Set the pot of palm fruit extract on the stove and start cooking at high heat, Leave to boil till you notice come red oil at the surface of the Banga Stew, If you think that the Banga Soup is watery, cook till the soup has thickened to the consistency you like for your stews, Now, add the beef, dry fish and stock, the onions, crayfish and pepper and leave to boil very well, Add the scent leaves or other vegetable and salt to taste., Leave to simmer for about 2 mins and the Banga Soup is done., Serve with White Rice",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843566/bang-her-soup.jpg",
    "videoLink": "https://youtu.be/FWF4R_5BzyQ"
  },
  {
    "id": "14",
    "state": "South East Nigeria",
    "name": "Moi Moi",
    "description": "Moi moi, also known as steamed bean pudding is made with either brown Beans, black eyed beans or lentils",
    "ingredients": "750g Beans(Either brown or black eyed beans), Salt, 2 habanero pepper, Crayfish, 4 stock cubes(Nutmeg/maggi), 2 teaspoons of ground nutmeg, 2 medium onions, 20cl vegetable oil, 2 litres of warm water, 3 tatashe peppers",
    "steps": "Cut the onions into smaller pieces and grind it, Grind the crayfish with a dry mill, Wash the tatashe  pepper.Remove the tatashe seeds as they can give the mea a bitter taste, Get Your beans which you should have soaked overnight and blend it(NOTE: Use a good blend for this step), Blend the beans, tatashe, habanero pepper ,onions,crayfish and your ground nutmeg together with some water and pour the mix into a pot, Add vegetable oil to your mix, Slowly add water and stir the mixture at the same time till all the ingredients are perfectly mixed, Add salt to taste and stir very well, Pad the base of the pot, pour some water . The depth of the water should be at most 1 inch, Dish the Moi moi mix into containers of your choice, Add as small quantity of water as possible at a time while cooking the Moi Moi so that the moi moi will not become watery when done, Regardless of the container you use, so that the moi moi will not become watery when done.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843565/moi-moi.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "15",
    "state": "General",
    "name": "Onion Baked Chicken",
    "description": "This chicken recipe is a very easy recipe",
    "ingredients": "1 small red onion, 3 chicken quarters, 2 small stock cubes, 1 teaspoon Nigerian curry powder, 1 teaspoon black pepper powder, 1 teaspoon thyme",
    "steps": "Get a pot and add water, Add your thyme,onions,stock cubes(Maggi or Knorr),curry powder, balck pepper powder, Add your Chickens and let it cook for about 20 mins, Transfer your chickens to an oven and let it cook for  5 mins, Your Onion baked chicken is ready",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591846312/onion-chicken.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "16",
    "state": "General",
    "name": "Barbecue Chicken Wings",
    "description": "This recipe is a  great evening and/or picnic snack. You can serve it at parties too.",
    "ingredients": "Chicken wings (wingettes and drumettes), Onion powder, Paprika powder, Ginger powder, Garlic powder, Black pepper, Pasley, Cilantro, Salt, Sugar, Corn flour, Tomato powder, Smoke flavour, Caramelized sugar",
    "steps": "Clean and rinse the chicken wingettes and drumettes and put in a bowl., Grind the remaining ingredients with a spice grinder., Add the ground seasonings and herbs, When you’ve got a good mix, cover and set aside to marinate for 30 minutes to 1 hour, Spread them out in a baking tray, Bake in the oven for 45 to 50 minutes turning them around at half time, Congrats! food is ready",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591846312/BBQ-Chicken-Wings.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "17",
    "state": "South Eastern Nigeria",
    "name": "Ofe Akwu (palm)",
    "description": "Banga Soup is also referred to as Ofe Akwu where Ofe means Soup / Stew and Akwu means palm fruit and is used mainly as stew for Boiled White Rice.The palm fruit oil extract used in cooking Banga Soup / Stew is quite different from the red palm oil used in cooking Nigerian food recipes.Palm Oil is pure oil extracted from the palm fruit pulp at high temperatures while the palm fruit oil extract used for the Banga Soup is extracted at a very low temperature and is a mixture of oil and water. Palm fruit oil extracted for Banga Soup contains less saturated fat than palm oils.",
    "ingredients": "800g tinned Palm Fruit Concentrate, Beef, Dry Fish, Vegetable: Scent Leaves for Ofe Akwu or bitter leaves for Delta-style, 2 medium onions, 2 tablespoons ground crayfish, Salt and Chilli Pepper (to taste), Locust beans, 1-2 big stock cubes",
    "steps": "Open the Palm Fruit Concentrate tin and set aside, Wash and cut the scent leaves into tiny pieces.The scent leaves give the Banga Stew (Ofe Akwu) its unique aroma and taste, Cut the remaining bulb of onion, Pound the crayfish, ogiri okpei and pepper in a mortar and set aside. You can also grind them with a dry mill, Cook the beef and the dry fish with 1 bulb of diced onion and the stock cubes till done, When the beef and fish are well done, add the palm fruit concentrate, Add water to get the consistency you like for your stews, Leave to boil very well, Add the onions, crayfish, pepper and ogiri blend and let it boil very well, Add the scent leaves or other vegetable and salt to taste, Leave to simmer for about 2 mins and the Banga Soup is done, If you used bitter leaves to prepare it, serve with Nigerian fufu meals especially Starch. If you used scent leaves to prepare it, serve with boiled white rice.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843566/bang-her-soup.jpg",
    "videoLink": "https://youtu.be/FWF4R_5BzyQ"
  },

  {
    "id": "18",
    "state": "Southern Nigeria",
    "name": "White Moi Moi (Ekuru)",
    "description": "White Moi Moi (Ekuru) is another way to enjoy beans. With a little alteration, it is suitable for vegetarians. It is to regular Moi Moi what Agidi is to Agidi Jollof or what Boiled White Rice is to Jollof Rice. It is prepared the same way as regular Moi Moi but with less added ingredients. It gets most of its taste and colour from the stew it is served with. On its own, White Moi Moi is tasty due to the seasoning it contains so you can skip the stew and enjoy it with a chilled drink.",
    "ingredients": "360g black eyed or brown beans for Four medium wraps of White Moi Moi, 1 small onion, 1 big stock cube, Salt (to taste), 600mls lukewarm water, 2 cooking spoons vegetable oil (optional), 250mls Tomato Stew, 2 small smoked mackerels, 1 small onion, 1 small stock cube, Salt and Habanero pepper (to taste), 1 teaspoon nutmeg",
    "steps": "About three hours before cooking the moi moi, soak and peel the beans., When done with step 1, put the peeled beans in a bowl and pour enough water to cover it. Leave to soak for three hours. This is so that the best consistency will be achieved when you blend the beans., Prepare Tomato Stew if you do not have some., Prepare the moi moi containers. You can use Aluminium foil or Plastic Bowls or Uma Leaves (Thaumatococcus Daniellii), Prepare some Smoked Fish and break into big chunks., Pound/grind the pepper., Cut the onions into small pieces., Crush the stock cubes., Blend the beans with the onions and crushed stock cubes and pour into a big enough bowl. Please note that the total quantity of water to be used (for blending and mixing) should be 600 mls, Add the vegetable oil (if using it) and stir, Slowly add the remaining water and stir the mixture at the same time till you get a good mix of all the ingredients., Add salt to taste and stir very well., Set some water in a pot to boil. The water should be about 1 cm deep., When the water boils, add some padding that will be a base for the Moi Moi wraps., Scoop the Moi Moi mix into your container of choice and gently place in the pot of boiling water., Repeat step 7 for the rest of the Moi Moi mix., When done, cover the wraps with some leaves or a plastic bag to keep the heat in., Cover the pot and start cooking on medium heat., Cook your Moi Moi for at least 45 minutes(Advised), before checking it., Check it from time to time and add small quantities of water at a time when necessary.The length of time you will cook your Moi Moi depends on the quantity and the Moi Moi container you used., The Moi Moi that gets done quickest is the one wrapped in Uma leaves, followed by Moi Moi wrapped in aluminum foils then the one that takes the most time is Moi Moi cooked in aluminium or plastic plates., Confirm that it is done by putting a knife through it, if the knife is stained with Moi Moi paste, then the Moi Moi is not done, but if the knife just has a slight smear of Moi Moi, then it's done., You can eat white Moi Moi with any tomato based stew, make sure the stew is seasoned with at least one traditional ingredients: smoked fish, iru, crayfish. You can prepare yours following the steps below, it'll be so delicious., Put the chunks of fish in a clean pot., Add the onions, some water, stock cube, pepper and nutmeg. Stir and start cooking., Once it boils, add the tomato stew., Cover and leave to simmer and it’s done!, Serve with the stew or skip the stew and serve the White Moi Moi with a chilled soft drink.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591965671/ekuru-white-moi-moi.jpg",
    "videoLink": "https://youtu.be/2rr-ESPYOwA"
  },

  {
    "id": "19",
    "state": "General",
    "name": "Zobo drink",
    "description": "Zobo is a Nigerian beverage made from dried Roselle plant flowers. The drink is also known as Roselle drink and called Sorrel drink in the Carribean.",
    "ingredients": "dry zobo leaves, 2 cups of dry Zobo leaves, 1 glove of garlic, 1 big piece of ginger, 1 big very ripe pineapple, 5 litres of water, some more citrus fruits of choice e.g orange, lemon, lime.",
    "steps": "Get a chiffon bag for seiving, Unpack the Zobo leaves into a container, Rinse the Zobo to get rid of dirts, Wash, peel and cut the pineapple into thin slices, Rinse the ginger, cloves and iyere one after the other, Add the iyere and cloves to the zobo, Pour it inside the chiffon bag, tie the bag and place it inside a deep pot of more than 5 litres volume capacity, Peel and cut the ginger and garlic into tiny pieces, Add the pineapples and pour enough water to cover the contents of the pot and then some, Start cooking at medium to high heat and let it boil for 5 minutes, Add the ginger and the garlic, add more water and keep boiling for at least 30 minutes. This is the time it will take for the zobo leaves to be completely soft and the pineapples tender., Turn off the heat and set aside to cool down completely, When cool, wringe out the juice from the pineapples and zobo leaves, leaving only the zobo juice in the pot, Pour the juice through a sieve to take out the remaining large particles then pour it through a chiffon cloth to remove the tiniest particles, Add any artificial flavours of your choice at this time and stir, Pour into bottles and refrigerate, Serve with ice and sliced fruits. Enjoy it on a hot sunny day with any Nigerian snack.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591846317/zobo-drink.jpg",
    "videoLink": "https://youtu.be/9ORwEUlFPZ0"
  },

  {
    "id": "20",
    "state": "General",
    "name": "Peppered Chicken",
    "description": "This recipe is a great snack to server it at parties too",
    "ingredients": "2 tatashe peppers, Salt (to taste), 1 tablespoon thyme, 1.2kg chicken, 2 Scotch bonnet peppers or habanero peppers, 2 onions, 1 cooking spoon vegetable oil, 6 small stock cubes",
    "steps": "Cut one of the onions into tiny pieces and cut the other into thin slices., Remove the seeds from the tatashe pepper and cut them   into small pieces, blend with a hand blender., Rinse and clean the chicken.Cut them into desirable sizes, Place the chickens in a bowl and add the thyme, diced onions and stock cubes (crushed), Massage the seasoning and spices into the chicken with your hands, cover and put in the fridge to marinate for at least an hour, When the chicken has marinated for 1 hour, place in a pot, pour some water and start cooking, if your using a pressure cooker, If your using a normal pot, just start cooking and by the time it starts to boil, water will seep out from the chicken, When the chicken is done, take them out and grill/broil in the oven at 180°C (350F), Pour the vegetable oil in a dry pot and heat it up, Add the pepper blend and start frying on low to medium heat till all the water dries up, Add the grilled/broiled peppered chicken and stir very well, till the popping red peppers have coated every inch of the chicken, You can add salt if necessary, Congrat! You're done.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843581/peppered-chicken.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "21",
    "state": "General",
    "name": "Tomatoes stew",
    "description": " The easiest and most popular stew to make is the tomato stew. Easy steps and ingredients make up this beautiful dish. ",
    "ingredients": "Fresh tomatoes, Chicken or any protein of your choice, vegetable oil, scotch bonnets, 1 bulb of onion, Garlic and ginger, 2 seasoning cube and salt to taste, Pumpkin leaf(optional)",
    "steps": "Blend tomatoes,pepper and half an onion together, season the chicken with 1 seasoning cube and salt. Put into a pot of boiling water and allow to cook, while your chicken is cooking, add oil into a pan and allow to heat up, chop the remaining half of the onion and add it into the hot oil, When the onion is golden brown, add the already blended tomato, stir and cover, By the time the stew is frying, the chicken should have been ready. Drain the chicken, fry on another pan(this is optional) and set aside, Add a little chicken stock to the stew when it is dried. Stir and cover, If you decide to use vegetables, chop them up and add into the stew. Stir and cover again, Add the fried chicken, stir and allow to sit for 3 minutes. Turn the heat off and serve with rice or yam or whatever you like,",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843575/tomato-stew.jpg",
    "videoLink": "https://youtu.be/709tecOPYYI"
  },
  {
    "id": "22",
    "state": "South west Nigeria",
    "name": "Asun (Goat Meat BBQ)",
    "description": "Asun is a traditionally made food. It is made of goat meat.",
    "ingredients": "1.2kg(2.6lbs) goat meat, 2 habanero pepper, 2 medium onion, 1 teaspoon thyme, seasoning cubes of choice, curry powder and salt, vegetable oil, 1 small green bell pepper and 1 small red bell pepper",
    "steps": "cut the goat meat with the skin into big chunks, wash and put in a bowl. Add thyme and other seasoning ingredients of your choice, Massage the ingredients into the meat and leave to marinate for 1-2hours, Blitz the habanero pepper and set aside, put the marinated meat into to pressure cooker so it cooks faster, slice 1 onion into big chunks and add it to the meat. Add little water and allow to cook, when the goat is well done, remove the chunk of onions. Drain the meat and set aside, lay the meat flat on your oven rack and grill at 180°c till it is brown all over. This should take a maximum of 15 minutes, while the meat is grilling, wash and cut the green and red bell peppers and the remaining onion. Thread them on toothpicks, when the meat is well grilled, heat the vegetable oil in a pot. Add the pounded habanero and a little of the goat meat stock. Fry for a bit and add the goat meat, stir for a bit and add the grilled meat. Stir till the pepper is absorbed by the meat, Empty the meat into a bowl lined  with  paper towel. And that's it, you can serve with the threaded toothpicks",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591963339/nigerian-asun.jpg",
    "videoLink": "https://youtu.be/jcUeJs4PyK8"
  },
  {
    "id": "23",
    "state": "South East Nigeria",
    "name": "Abacha (African salad)",
    "description": "Abacha, also  known as African Salad, is a highly nutritious delicacy native to the Igbos in the South-Eastern part of Nigeria. It is normally served at Igbo traditional gatherings and also be enjoyed as a dessert, appetizer or a full meal.",
    "ingredients": "2 tablespoons Powdered Potash, 1 large Onion, Salt and dry pepper ( Add to taste), 4 tablespoons ground crayfish, 2 stock cubes (Maggi/Knorr), 1 teaspoon ground Ehu seeds (Calabash Nutmeg), 30 cl red palm oil, 2 cups ugba (ukpaka), 2 to 3 handfuls abacha 1 teaspoon Tru/Ogiri, 3 Fresh Utazi leaves (Gongronema latifolium), Garden Egg leaves, Garden Eggs (As much as you want), 1 medium onion (for serving)",
    "steps": "Prepare the ehu seeds by roasting, peeling and grinding them with a dry mill, Wash and cut the vegetables into tiny pieces, Cut the big bulb of onion into tiny pieces and cut the medium one in circles, Wash the garden eggs and set aside, there is no need to cut these, Grind the crayfish and pepper, Soak the Abacha in cold water. Once the Abacha has softened, put in a sieve to drain, Rinse the Ugba with lukewarm water, Put the powdered potash in a bowl and pour about 1 cup of cold water, then stir well, Pour the palm oil into a sizeable pot, Pour the water from the potash mixture in the pot, make sure not to pour the sediments, Stir very well and you'll see the oil turn into a yellow paste, Add the ground pepper, ground ehu, crushed stock cubes (Maggi/knorr), crayfish, diced onions and ugba (ukpaka), then stir very well, dd the iru/ogiri and make sure it is mixed very well, Add the diced kanda/pomo and stir very well, Now add the soaked and drained Abacha and stir till it mixes well in the palm oil paste, Add the sliced Utazi and salt (to taste) and stir well. It is important that you add salt last because after adding all the seasoning, your Abacha may not even need salt any more., Abacha can be either served cold or warm. if you like yours warm, transfer to a gas cooker or stove and heat it up to your desired temperature, When done, turn off the heat and add the sliced garden egg leaves , stir very well and serve, If you like your Abacha cold, just add the sliced garden egg leaves, stir very well and serve",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843546/sisi-nkwobi.jpg",
    "videoLink": "url of video"
  },

  {
    "id": "24",
    "state": "General",
    "name": "Unripe Plantain Porridge",
    "description": "This recipe is cooked with unripe plantains which  are known to be rich in iron. The recipe is fast and easy",
    "ingredients": "A big bunch of Nigerian pumpkin leaves, 3 unripe plantains, 1 medium fish (Mackerel), 1-2 teaspoons ground crayfish, 2 medium onions, Red palm Oil(enough to colour the mea), Pepper and Salt (Add to taste), 2 big stock cubes",
    "steps": "Wash, peel and cut up the plantain into smaller pieces with a knife, Rinse and cut the pumpkin leaves into small pieces, Wash, cut the fish into smaller pieces and remove the fish intestines, Grind the crayfish and pepper, Put the cut plantain in a pot, Pur the chopped onions, stock cubes, fish, ground crayfish and pepper in the pot, Add water to the same level as the contents of the pot, Cook till the contents start to boil, Add the red palm oil and salt to taste, Cover the pot and keep cooking till done.This is when the plantain is tender to touch, Add the vegetables, cover the pot and let it simmer, Once it has heated up, stir, turn off the heat and leave it for at least five minutes before serving.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591846337/Plantain-porridge.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "25",
    "state": "Northern Nigerian",
    "name": "Tuwo Shinkafa",
    "description": "Tuwo Shinkafa is a northern Nigerian fufu recipe that is prepared with the soft rice variety. \nIt is usually served with Northern Nigerian soups: Miyan Kuka, Miyan Taushe etc. It also goes well with other Nigerian soups.\nThe rice used for Tuwo Shinkafa should be the a soft rice variety that becomes sticky when cooked. This is so that the grains can be easily mashed to make a mass of fufu (tuwo).",
    "ingredients": "Short/Medium grain soft rice, Water (enough quantity to cook the rice till very soft and sticky)",
    "steps": "Rinse the rice in cold water and put in a sizeable pot., Pour just enough water to cover the rice and start cooking at medium heat., When the first dose of water dries up, check the rice by mashing it between your fingers. If the rice grains have even a tiny resistance when you press them, then it needs to be cooked some more., Reduce the heat to low, add a little bit more water and continue cooking till the water dries., Repeat the process till the rice is so soft that it melts when you press on it., Once you're happy, mash the rice with a wooden spatula by moving the rice in small quantities the far end of the pot to your side of the pot, Fold the mound of tuwo and repeat till all the rice grains have turned into a mass of tuwo, Cover and leave it to steam for about 2 minutes, Mix thoroughly and dish serving quantities onto a thin plastic film and wrap them up. This wrapping prevents the tuwo from drying up., You can also serve them in smaller balls as shown in the image above, Serve Tuwo Shinkafa with any Nigerian soup.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843581/peppered-chicken.jpg",
    "videoLink": "https://youtu.be/Zdjfq2RI51s"
  },
  {
    "id": "26",
    "state": "General",
    "name": "Coconut Rice",
    "description": "This combination of coconut,rice and spices is easy to prepare and can be served on its own or as part of main course",
    "ingredients": "750g long grain parboiled rice, 500mls Tomato Stew, 600 mls of Coconut Milk, Chilli pepper ( Add to taste), Salt (Add to taste), 1 medium onions, 3 stock cubes, 1 tablespoon thyme",
    "steps": "Prepare the tomato stew. It is advisable to prepare tomato stew before hand. wash the chicken pieces and place them in a pot; add water till it covers the pieces of chicken, add the chopped onions, stock cubes(Maggi/knorr) and thyme. Then start cooking. Put the pieces of chicken in a sieve to drain, then fry with vegetable oil. You can also grill it in an oven. Parboil the rice. Wash the parboiled rice and put in a sieve to drain. Pour the chicken stock, coconut milk and the tomato stew into the pot. Add the drained parboiled rice, salt and pepper to taste. You may have to top up the water to bring the water level to the same level as the rice. This is to make sure that all the water dries up by the time the rice is cooked. Cover the pot and leave to cook, Making sure to check what your cooking once in awhile so that the water doesn't dry up and the rice get burnt. Congrats ! your food is ready",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591963356/coconut-rice.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "27",
    "state": "General",
    "name": "Pepper Soup",
    "description": "Light and spicy soup traditionally made with goat meat, but often with fish or other meat, as well as herbs and Nigerian spices. As the name implies, this soup is not for the fainthearted, it is ‘hot, hot, hot!’ – although the level of spiciness ranges from the mild to the eye-watering, air-gulping variety. Pepper soup is a stand-alone dish, usually eaten accompanied by a cold bottle of beer (or water), but some brave souls eat it with other meals. Pepper soup is made from a variety of spices and fish, beef, goat meat or chicken chopped into bite-sized pieces. Pepper soup is West Africa's version of chicken soup.",
    "ingredients": "1 pound Goat meat, 2 Tsp Crayfish, 1 Tbs Pepper soup spice, 1 Tsp Red Chili flakes, 1 Tsp Ginger powder, Salt, 1 small Onion, 1 Scotch bonnet, 1 Seasoning cube, 2 Tsp Bitter leaves, 4 Cups Water",
    "steps": "Cut the Goat meat into cutlets (see note 4). Then rinse thoroughly, transfer the meat into the Pot, add salt, Seasoning cube, habanero peppers and half of the Onion (see note 5) and cook for 30 minutes. Add the pepper soup spice, red chili flakes, Ginger powder, the remaining grated onion, and crayfish. Leave it to cook for another 10 minutes. Stir in the uziza leaves and let it simmer for another 5 minutes. Serve hot with Yam, Rice, Bread and more.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591963330/pepper-soup.jpg",
    "videoLink": "https://youtu.be/yCtqSy1kINY"
  },
  {
    "id": "28",
    "state": "Northern Nigeria",
    "name": "Masa",
    "description": "Masa is a sweet and sour rice cake from the northern part of Nigeria.This recipe is a Northern Nigerian delight and it’s made by soaking a special type of Rice called Tuwo Rice (the uncooked one) in water for at least 6 hours or overnight. This Rice is then rinsed out and blended into a smooth paste before it’s now cooked inside a special pan which we refer to as the Masa Pan. As a meal, it is eaten with either miyan taushe (pumpkin soup) or yaji (spiced groundnut powder).",
    "ingredients": "3 Cups Rice, 3 tablespoons cooked Rice, 11/2 Tablespoons Ginger, 2 Tablespoons, 1/2 Teaspoon Baking powder, 1 Onion, 2 teaspoons yeast, 1 Teaspoon Salt, 2 to 4 Tablespoons Sugar, 1 Cup Water plus 2 to 4 more Tbs, Dambu Nama for stuffing",
    "steps": "Soak the Rice in Water for at least 6 hours or leave overnight. Rinse out the Rice until it's clean and proof your yeast by mixing the Water with the Yeast and 2 Teaspoons of sugar then set that aside. Blend the soaked Rice, pre-cooked Rice, Onion and Ginger together until it's smooth and creamy. Pour the Batter into a very large Bowl, add the Yeast and mix it together and leave to proof for 6 to 8 hours. You can as well leave overnight. The longer you leave it the more fermented it becomes. Add the Baking powder, Salt, Sugar and the Yogurt. Drizzle some cooking Oil in your Masa Pan and once the Oil is hot enough pour some batter into the Pan about halfway full, immediately add the Dambu Nama stuffing and immediately cover this up with another layer of batter - this should be done very fast because Masa cooks really fast. When the edges begin to solidify, flip the Masa over with two skewers (check the video above) and once both sides are well cooked (golden brown) remove from heat and enjoy while still hot and fresh with your favorite stew or sauce. Enjoy!",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591963350/masa-rice-cake.jpg",
    "videoLink": "https://youtu.be/gp0LSjRxIXw"
  },
  {
    "id": "29",
    "state": "Cross River state and South South Nigeria",
    "name": "Afang soup",
    "description": "Afang soup, also known as Okazi soup and Ukazi soup, is a vegetable soup that originates from the Efik people of the Efik kingdom in Cross River State and the Ibibio People of Akwa Ibom in South South Nigeria. Made with the expensive vegetable, afang leaf, found only in the rainforest of Calabar and Cameroon. The soup is created from a mixture of afang leaf, water leaf, dried cod head, scotch bonnets, snails and a host of other ingredients. The soup can be eaten with garri (also known as eba – dried ground cassava prepared with hot water), pounded yam or semovita.",
    "ingredients": "beef, dried fish, bushmeat, crayfish, shaki (cow tripe), kanda, pumpkin leaves, palm oil, periwinkle, pepper, onion, ugu, water leave, salt",
    "steps": "Wash, drain and slice the water leaves into tiny pieces. Grind or pound the sliced Okazi leaves. In Nigerian markets, the sellers of these sliced Okazi leaves have a machine for grinding it. You can also grind it with your blender with a small quantity of water. Grind your pepper and crayfish and cut the onions into tiny pieces. Boil the beef and Kanda with the diced onions and stock cubes in a very small quantity of water. When done, add the dry fish and cook for about 5 more minutes. Now add the palm oil, crayfish and pepper. Once it starts boiling, add the afang (okazi) leaves, water leaves and periwinkle. When the okazi leaves have softened and the water has dried up a bit, add salt to taste and leave to simmer for about 5 minutes. The Afang soup is ready!",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591963343/afang-soup.jpg",
    "videoLink": "https://youtu.be/X8Opl6zyCIE"
  },
  {
    "id": "30",
    "state": "General",
    "name": "Moi-moi",
    "description": "Moi-moi, or moin-moin is a bean meal that can be bought from street corners, particularly in the southwest of Nigeria. Moi Moi can be very challenging to prepare because everything is mixed off the stove before cooking. If you get the mixing wrong, there is no going back once you start cooking. The beans are peeled and ground with scotch bonnets and onions, and then wrapped in thaumatococcus leaves (ewe eran in Yoruba). According to Yemisi Aribisala and her book Longthroat Memoirs, for the moin-moin elemi meje variety (moin-moin with seven lives) you need eggs, flaked mackerel, corned beef, fresh prawns, cubes of beef, and smoked fish. I usually cook Moi Moi in a large quantity and store in my freezer so the following quantities of ingredients make 12 aluminium bags of Moi Moi. Each bag weighs 420g.",
    "ingredients": "3 cigar cups or 750g Beans (Brown/Black eyed), 5 tablespoons ground crayfish, 4 big stock cubes, 1 habanero pepper, 2 teaspoons ground nutmeg, 3 tatashe peppers or 800g watery tomato puree (sold outside Nigeria),2 big onions, 20cl vegetable oil, 2 litres of cool or warm water, Salt (to taste), Hard boiled eggs: Cut the eggs into small pieces. Bone Marrow: Cook the bone marrow with spices and herbs till done then add to the Moi Moi at the mixing stage. Corned beef: separate into small chunks and add to the moi moi during mixing. You can also add to the moi moi after dishing then into cooking bowls or foil bags,",
    "steps": "About three hours before cooking the moi moi, soak and wash the beans to remove the coat. When the entire coat has been removed, place the beans in a bowl and pour enough water to cover it. Leave to soak for three hours. This is so that the best consistency will be achieved when you blend the beans. It is advisable to use one of eggs, bone marrow or corned beef, not the three at the same time. If you will use eggs, cook till hard boiled, cut into small pieces and set aside. If you prefer bone marrow, cook it with salt and Maggi / Knorr cubes and set aside the stock. If it is corned beef you will go for, open the can and separate the beef into small lumps. Now go ahead and prepare the moi moi containers. Wash the tatashe pepper (if using it). Ensure you remove the tatashe seeds as they have a tendency to give meals a bitter taste. Cut the onions into pieces, grind the crayfish with a dry mill. If using the heavy duty grinder in Nigerian markets, these won't be necessary. Crush the stock cubes and set aside. Wash the habanero/scotch bonnet peppers and set aside. Now that the beans is soaked (the bean seed is tender when you pinch it), it is time to blend it. It is very important that you use a very good blender for this purpose. The taste and feel of your Moi Moi depends so much on the consistency of the blend. If in doubt, put a small quantity of bean seeds in your home blender and grind to the best of its ability using as small quantity of water as possible. Feel the resulting paste with your fingers and if you notice any tiny pieces at all, then the blender is not good for Moi Moi. At this time, you may consider using the commercial heavy duty mills at your local market if you are in Nigeria. Yes, you have your health and hygiene concerns but most of the mill operators actually keep their mills clean. And they let you bring your own water and containers. So there you go! Blend the beans, tatashe or tomato puree, onions, crayfish, habanero pepper and ground nutmeg together with some of the water and pour the mix into a big enough bowl. Add the vegetable oil and the bone marrow stock (if this is what you have chosen to add to your moi moi). Slowly add the remaining water and stir the mixture at the same time till you get a good mix of all the ingredients. Add salt to taste and stir very well. Note: Moi Moi is one of the Nigerian food recipes that is prepared cold. All the mixing and adding of ingredients is done off the stove. That is to say, once you start cooking, there is no going back! You cannot decide to add more salt or seasoning or a new ingredients later. So getting it right at the mixing stage is very important. Pad the base of a big pot, pour some water and set on the stove. The depth of the water should be at most 1 inch. Dish the Moi moi mix into containers of your choice, add egg/bone marrow/corned beef to e ach container, seal/cover and set them in the pot. Add as small quantity of water as possible at a time while cooking the Moi Moi as detailed in preparation and use of moi moi containers so that the moi moi will not become watery when done. This is the case especially when using aluminium foil or uma leaves. The length of time you will cook your Moi Moi depends on the quantity and the Moi Moi container you used. The Moi Moi that gets done quickest is the one wrapped in Uma or Banana leaves, followed by Moi Moi wrapped in aluminum foils then the one that takes the most time is Moi Moi cooked in aluminium or plastic plates. But whatever Moi Moi container you use, it is advisable to cook your Moi Moi for at least 1 hour, before checking it. Confirm that it is done by putting a knife through it, if the knife is stained with Moi Moi paste, then the Moi Moi is not done, but if the knife just has a slight smear of Moi Moi, then it's done. Also, when you cut through the Moi Moi, the insides will be set and not watery. If you are cooking a few wraps of Moi Moi in a small pot on high heat, then it will only take about 45 minutes to get done while when you are cooking a large pot of Moi Moi, it will definitely take more than one hour.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843565/moi-moi.jpg",
    "videoLink": "https://youtu.be/HpmnBzeWz8Q"
  },
  {
    "id": "31",
    "state": "South west Nigeria",
    "name": "Ewa Agoyin",
    "description": "This dish was brought across the border from Benin Republic by the Aganyin people (Yoruba speaking) into the southwest. Ewa agoyin are specially prepared beans, cooked until the grains cling fluffily to one another, creating a melting sensation on the tongue. The kicker is the specially prepared stew it is eaten with. Ewa agoyin is usually eaten with hot agege loaves.",
    "ingredients": "2 cigar cups (approx. 500g) brown/black eyed beans, 5 cooking spoons red palm oil, 5 big plum tomatoes, 1 handful crayfish, 1 big onion, Pepper & Salt (to taste), 2 stock cubes",
    "steps": "Soak the beans in cold water for 5 hours. Boil the beans for 5 minutes and discard the water. Rinse the beans in cold water and set aside. This soaking and pre-cooking process will help reduce the gas inducing elements. Chop the onions, grind the crayfish and pound the pepper. Blend the tomatoes and boil the tomato puree till all the water has dried from it. Pre-cook the diced onions without any added water. The aim is to get it to caramelize a bit so that it will take less time to fully caramelize during frying. Cook the beans till done. For Ewa Agoyin, the beans needs to be very soft. When the beans is done, add salt, leave to dry up all the water and set aside. To cook the Agoyin, pour the palm oil into a separate dry pot. Allow to heat up till the oil starts smoking and the red colour changes to clear. It is better to do this at medium heat so that the oil does not get too hot too quickly. Remember to turn off your smoke alarm before doing this. To keep the smoke to a minimum and still have the traditional taste of Ewa Agoyin, I use vegetable oil and when it is very hot, I add a small amount of palm oil. Watch the video below to see how I do that. Now add the precooked onions and stir continuously till the onions is fully caramelized. It should be very dark in colour. Add the parboiled tomato puree and stir continuously till you cannot tell the difference between the tomatoes and onions. Add the pepper, crayfish, stock cubes and salt to taste. You can also add a little water at this point if your want. Stir very well and bring to the boil. The Ewa Agoyin is ready!",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591963340/ewa-agoyin.jpg",
    "videoLink": "https://youtu.be/jQ_pgHgwyZM"
  },
  {
    "id": "32",
    "state": "South West Nigeria",
    "name": "Pounded yam",
    "description": "Yams that have been crushed or stirred to a creamy, dough-like consistency. Pounded yams are considered a fufu (a kind of starchy side dish) usually served with a stew or efo.",
    "ingredients": "yam, boiled water",
    "steps": "you simply cook white yam and pound the yam pieces with a mortar and pestle when done. Sounds easy, doesn't it?",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591963331/pounded-yam.jpg",
    "videoLink": "https://youtu.be/_OcV_0C8G-g"
  },
  {
    "id": "33",
    "state": "General",
    "name": "Egusi Soup",
    "description": "A stew usually made with crayfish or other meat and thickened with ground melon seeds (egusi). This soup gets its name from protein-rich egusi that lends the dish its velvety, creamy texture and rich flavor. Egusi is satisfying on its own. It is a staple in most West African home and it is an uncomplicated one pot meal that is often accompanied with swallows like Eba, Amala, Semovita, Pounded yam, Fufu, and the likes.",
    "ingredients": "2 Cups Melon, 1 Cup Palm Oil, 4 Tbsp Crayfish, 3 Tbsp locust beans, 24 oz chopped spinach, 1 Red Bell Pepper, 1 Habanero Pepper, 1 Fresno Pepper, 2 Onions, Stock Cube, 1 lb Beef, Salt To Taste, 3 cups Beef stock",
    "steps": "Blend the peppers and Onions together until smooth and set aside. Blend the Egusi melon, half of the second Onion, and Crayfish together. Set aside as well. Heat the Palm Oil in a pan and allow it to melt over medium heat but don't overheat the Oil. Add the remaining half onion (diced) and half of the Locust bean. Let it cook for about 3 minutes on medium heat. Add the blended pepper and cook till the water is reduced this should take about 15 minutes on medium heat until the water is reduced stirring about every 5 minutes to prevent burning. Add the remaining locust bean, Beef stock, and salt to taste. Cover and leave to cook for another 5 minutes. Gently introduce the blended Egusi inside the sauce but don't stir it at this point. Just cover it and leave it to cook for about 20 to 30 minutes Keep an eye on it so it doesn't burn but try not to stir it until the Egusi turns into a soft compact mass. Then, gently stir together and add more stock or water if necessary. Add the Fish and meat and leave to cook again for another 5 minutes. Stir in the Spinach and leave to simmer for about 5 minutes (stir constantly).  Adjust the seasoning if necessary. Serve while still hot.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591963340/egusi-soup.jpg",
    "videoLink": "https://youtu.be/LqGj3_UT9h8"
  },
  {
    "id": "34",
    "state": "South West Nigeria",
    "name": "Àmàlà",
    "description": "Àmàlà is a local indigenous Nigerian food, native to the Yoruba tribe in the South-western parts of the country. It is made out of yam and/or cassava flour, or unripe plantain flour. Yams are peeled, sliced, cleaned, dried and then blended into a flour, also called elubo. Yams are white in colour but turn brown when dried. This gives àmàlà its colour. Àmàlà is from Western Africa and eaten mostly by the Yoruba people in Nigeria. Amala is mainly consumed by indigenous people of the Southwestern part of Nigeria.[4] It could be served with a variety of ọbẹ (soups), such as ẹfọ, ilá, ewédú, ogbono or gbegiri (black-eyed beans soup). There are three types of amala; Yam flour (amala isu), Cassava flour (amala lafun), Plantain flour (amala ogede)",
    "ingredients": "Boiled Water, One of the different types of flour, some more",
    "steps": "The only ingredients needed when making àmàlà is boiling water and one of the desired types of flour. Once the water has come to a boil, the heat is reduced. The flour is added and stirred until all the water is absorbed. More hot water is added, then the dough is left to simmer for approximately five minutes. Then the dough is kneaded until it has the desired texture. Kneading the dough into a smooth paste is the most difficult part of making àmàlà",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591963365/amala.jpg",
    "videoLink": "https://www.youtube.com/watch?v=HpiVPxCNuYo"
  },
  {
    "id": "35",
    "state": "Enugu State of Nigeria",
    "name": "Echicha Ede",
    "description": "Ẹchịcha (also, Achịcha) is a dish native to the Igbo part of Nigeria consisting mainly of dried Cocoyam, mgbụmgbụ (Pigeon pea), and palm oil. It is traditionally eaten in the dry season when fresh vegetables are hard to come by. It is one of the most traditional meals in Igboland.",
    "ingredients": "3 cups achicha ede (cocoyam flakes), Pigeon pea, Crayfish, Seasoning cubes, ½ cup red palm oil, ụgba (seed of the oil bean tree), 600g green leafy vegetables, Scent leaves (nchanwu, efirin), Red Onion, Fresh Pepper, Salt (to taste)",
    "steps": "Ẹchịcha is made by steaming the dried cocoyam and mgbụmgbụ until they are soft, then mixing the two thoroughly with a sauce made of palm oil, ụgba (seed of the oil bean tree), onions, fresh pepper, and salt.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591963355/achicha-ede.jpg",
    "videoLink": "https://youtu.be/VK2LC0trtEY"
  },
  {
    "id": "36",
    "state": "Cross River State in South Eastean Nigeria",
    "name": "Edikang Ikong",
    "description": "Edikang Ikong is a vegetable soup that originated among the Efik- Ibibio people of Akwa Ibom State and Cross River State in Southeastern Nigeria. It is considered to be a delicacy among some Nigerians, and is sometimes served during occasions of importance. Edikang Ikong is a very nutritious soup and is expensive to prepare, and has been described as being mostly eaten by rich people in Nigeria.",
    "ingredients": "Beef, dried fish, bushmeat, crayfish, shaki (cow tripe), pumpkin leaves, ugu, onion, periwinkle, palm oil, salt, pepper",
    "steps": "Wash and cut the pumpkin and water leaves into tiny pieces. Put them in separate sieves to drain out all the water as much as possible. Cut the Kanda into small pieces. Cook the beef, kanda and the dry fish with the 2 bulbs of diced onions and the stock cubes with as little quantity of water as possible., When the meat is done, add a generous amount of palm oil, the crayfish and pepper and leave to boil for about 10 minutes. The palm oil serves as the liquid in the Edikang Ikong soup. You should try as much as possible to make it the only liquid in the soup. Add the periwinkle and water leaves and leave to cook for another 5 minutes. You may have to cook for less time at this stage so that the water leaves are not over-cooked. Now add the pumpkin leaves and salt to taste. Stir the contents of the pot very well and turn off the heat. Cover the pot and leave to stand for about 5 minutes.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591963355/edika-ikong.jpg",
    "videoLink": "https://youtu.be/B3X4gxPnikU"
  },
  {
    "id": "37",
    "state": "General",
    "name": "Nigerian Jollof Rice",
    "description": "This is a very rich and versatile  one-pot Meal. The Nigerian rice recipe discussed here is the classic Nigerian Jollof Rice served at parties. This is a very popular Nigeria rice recipe.",
    "ingredients": "750g long grain parboiled rice, 2-3 cups Tomato Stew, Pepper and salt (Add to taste), 2 medium onions, 3 Knorr cubes, 2 teaspoons thyme, 2 teaspoons curry powder (Nigerian curry powder)",
    "steps": "Prepare the tomato stew, Parboil the rice.Rinse the parboiled rice and put in a sieve to drain, Pour the tomato stew into a sizeable pot and leave to boil, Add the drained parboiled rice, curry powder, salt(Add to taste) and pepper(Add to taste) to the pot. Then add water, the water level should be the same level of the rice. This is to ensure that all the water dries up by the time the rice is cooked. Cover the pot and let it cook on low to medium heat. This way the rice does not burn before the water dries up. By the time the water is dry the rice should be done. Taste To confirm,if you would need to add more water and reduce the heat to prevent burning. keep cooking, still it's done.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843568/jollof.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "38",
    "state": "Eastern Nigeria",
    "name": "Ofe Nsala (Nsala Soup)",
    "description": "Ofe Nsala is the quickest and easiest Igbo Soup to prepare making it the choice soup for special guests who are so familiar to us that they pay us impromptu visits.",
    "ingredients": "1 big Catfish (Catfish is the fish for Ofe Nsala)., White yam, 5 Utazi leaves, Small piece of ogiri okpei, A handful crayfish, Habanero pepper (to taste), Salt (if necessary), 1 big bulb of red onion, 2 seasoning cubes",
    "steps": "Boil hot water and pour on the pieces of fish to remove the slime on the fish as well as toughen them. You want to toughen the catfish so it does not disintegrate in the soup, Quickly rinse off the slime with cool water and place the fish in the cooking pot, Peel the yam and cut into medium pieces, Chop the utazi and pound in a mortar (or blend in a blender) with the pepper, ogiri okpei and crayfish. Just give them a rough pound. Same with if you are using a blender, Add the seasoning cubes (crushed) to the pot of fish, Add the pieces of yam, Pour water to cover everything and start cooking., When the yam is soft and moist, bring them out and place in a mortar., Add the pounded crayfish, pepper, ogiri okpei and utazi into the pot of fish and continue cooking, Pound the cooked yam in a mortar till smooth and stretchy, Add the yam into the pot of Ofe Nsala in small lumps, cover and continue cooking, Once the yam dissolves and thickens the soup, it is done, If you achieve medium consistency before all the yam is dissolved, take out the undissolved yam because you do not want the Ofe Nsala to be too thick, Add salt if necessary, stir very well and that’s it, Serve with Pounded Yam, Semolina or Fufu.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843585/ofe-nsala.png",
    "videoLink": "https://youtu.be/FB7d7WoRlwk"
  },
  {
    "id": "39",
    "state": "South East Nigeria",
    "name": "Nkwobi",
    "description": "Nkwobi is a delicacy that is usually ordered at exclusive restaurants. It's simply cooked cow foot mixed with spicy palm oil paste",
    "ingredients": "2kg(4.4 lbs) of cow foot , which would be cut into sizeable pieces, 20cl(200ml) of Palm Oil, 1 tablespoon of powdered edible potash, 1 teaspoon ground Ehu seeds( Calabash nutmeg), 1 sizable onion, 2 habanero pepper or you can add it to your taste, Salt( to taste), To garnish: 1 medium onion and 10 utazi leaves",
    "steps": "Cut the cow foot into medium chunks, Put the powdered potash into a bowl with small water and stir well. pass it through a sieve and set the liquid aside, Cut 1 onion into 4 big chunks, Pound the pepper with a mortar and pestle, Grind the crayfish, Crack and remove the outer shell of the ehu and grind it with a dry mill (e.g coffee grinder), Wash and put the cow foot chunks in a pot, Add the stock cubes(Maggi/Knorr)  and the chunks of onion, All a little water and start cooking still it's well cocked. Add just enough water to prevent burning as you cock. There should not be any stock (water) in the pot when the cow foot chunks are done, While the meat is cooking , pour the palm oil into a clean dry pot, Pour the potash mixture that has already then sieved into the oil, Stir with a spatula as you pour the potash. The palm oil will begin to curdle and turn yellow, Add the ground crayfish, ehu seeds and pepper. Stir very well till they are all incorporated, When the meat is done , add sait , stir and cock till all the water has dried up, Add the well done cow foot to the palm oil paste and stir it very well, Cock until the Nkwobi is hot, stir it all the time to make sure it does not burn, To prepare the garnish, cut the onions into rings and cut the utazi into long thin slices, Add the onion rings and thin slices of utazi on top of the Nkwobi. Your Nkwobi is ready!",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843546/sisi-nkwobi.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "40",
    "state": "Benin-City, Edo",
    "name": "Owo Soup",
    "description": "You haven't been to Edo state if you've not tried their traditional owo soup. It is the oldest prepared and eaten soup of the edo people. It is usually thick and bare compared to other Nigerian soups. To prepare this delicious delicacy, the following ingredients are required.",
    "ingredients": "Dried or smoked fish, Goat meat or assorted meat, Cray fish, 1 handful of dried prawns, Fresh or dried pepper, potash, 1 onion bulb, 5 fresh tomatoes, 1 seasoning cube, salt",
    "steps": "wash and add the meat to a pot. Add the chopped onion, seasoning cube and salt to taste. Allow to boil for 3 minutes, Add the smoked fish, blended tomatoes, pepper and crayfish into the pot. Allow this to boil for 10 minutes, Stir continuously to avoid burning, Add the potash into a bowl of boiling water to dissolve. Strain and carefully add the liquid into the pot. Leave to cook for a few minutes, Add the palm oil and allow to cook then stir. Note that the addition of the potash is what gives the soup it's thickness, Finally, serve with any swallow of your choice.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843588/owo-soup.jpg",
    "videoLink": "https://youtu.be/txx_GTJWf0A"
  },
  {
    "id": "41",
    "state": "General",
    "name": "Special Okra Soup",
    "description": "This Okra Soup recipe is the most concentrated Okra Soup ever. It is meant for only licking! Yes, we say you lick the soup when we “eat” just the soup. That means no need for a fufu meal. The soup is that conc, with lots of vitamins. This is best for those who want to reduce or maintain their weight.",
    "ingredients": "500g okra, ,1.2kg beef, 2 medium smoked mackerels (titus fish), 1 sweet pepper, 10 mushrooms(optional), ¼ cup palm oil, Leafy vegetable (ugu or spinach), 1 big bulb of red onion, 2 seasoning cubes",
    "steps": "Debone the fish and break them up into big chunks., Rinse and prep the okra by hand-cutting it., Chop the peppers, Slice up the mushrooms (if available), Chop the onions, Boil the beef with seasoning cubes (crushed) and half of the chopped onions, When done, set the stock aside. The stock should be little by the time the beef is well done, In a clean dry pot, fry the sliced mushrooms with the palm oil. Fry for at most 5 minutes, Take out the mushrooms, Stir-fry the diced okra and remaining onions in the oil for a bit. Do not over-fry, Start adding the meat stock bit by bit. Add, stir till you notice the elasticity of the okra coming through. Repeat till all the stock is used up, Add the rest of the ingredients into the pot with the leafy vegetable on top., Cover and steam till the leafy vegetables at the top wilts from the heat, Stir till everything is well combined then add salt to your taste and mix well, The Okra Soup should be VERY thick when done.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843582/okro-soup.jpg",
    "videoLink": "https://youtu.be/g-FoiBNDVg8"
  },
  {
    "id": "42",
    "state": "General",
    "name": "stir-fry chicken spaghetti",
    "description": "just when you thought spaghetti couldn't get any better, it did. This dish is finger-licking good and would have you coming back for more. So if you're thinking of spicing up your meal plan, you should definitely add this to the list.",
    "ingredients": "Boiled and drain chicken, vegetable oil, 1 bulb of onion, Thyme and curry powder, sliced green and red bell peppers, 2 each, 1 seasoning cube, A pack of thin spaghetti, Salt to taste",
    "steps": "Add oil into a pan and allow to heat up, Add chopped onion into the hot oil, Stir and Add the blended peppers, Add thyme and curry powder. Stir and add the sliced garlic and ginger, Cover and allow to dry, when it is dried, empty it into a bowl, In the same pan, add your already boiled chicken, season and stir fry until it is well cooked, while the chicken is stir-frying, add water into a pot. Add salt to this boiling water, Add spaghetti to the boiling water and allow to cook, Add the vegetable(pepper) into the pan containing the chicken. Add half a seasoning cube and mix together, Drain the cooked spaghetti and add it into the stir-fry mixture. Stir together properly, put off the heat and get ready to have a mouth watering meal",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591846315/spaghetti.jpg",
    "videoLink": "url of video"
  }
]
