[
    {
      "id": "1",
      "state": "South West Nigeria",
      "name": "Efo riro soup",
      "description": "Efo riro is one of the most popular vegetable soups in Nigeria and an absolute favorite of Yorubas. It is rich with vitamins and an amazing variety of protein.” To prepare this finger licking delicious delicacy, the following ingredients are needed;",
      "ingredients": "1. 500g potatoes, \\n 2. 5 fillets of chicken breast, \\n 3. Green, red and yellow bell peppers,\\n 4. 1 red onion,\\n 5. Garlic and ginger,\\n 6. ½ teaspoon of thyme,\\n 7. salt,\\n 8. curry powder and onion powder,\\n 9. 2 tablespoons pepper sauce,\\n 10. 2 tablespoons soy sauce,\\n 11. vegetable oil",
      "steps": "First you blend the bonnets, bell pepper and onion and set aside. Then you wash the vegetable with hot water and slice, Season the assorted meat in a pot and cook, Make sure to cook the touched meat first before the soft ones, Add palm oil into a big pot and allow to heat up. Add onion to the hot oil and stir,  Add the locust beans and stir for about 3 minutes. Add the blended pepper and let it dry for 15 minutes.  When a thick consistency is achieved,  add a little water and allow to cook for 2 minutes. Now add the already boiled meat and 1 seasoning cube. Taste and add salt if needed and finally add the vegetable. Stir thoroughly, switch of  the heat and serve with your favorite swallow.",
      "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843589/Efo-Riro.jpg",
      "videoLink": "url of video"
    },
    {
      "id": "2",
      "state": "South East Nigeria",
      "name": "Onugbu Soup",
      "description": "This is a traditional soup native to the South Easten part of Nigeria",
      "ingredients": "1. 500g potatoes, \\n 2. 5 fillets of chicken breast, \\n 3. Green, red and yellow bell peppers,\\n 4. 1 red onion,\\n 5. Garlic and ginger,\\n 6. ½ teaspoon of thyme,\\n 7. salt,\\n 8. curry powder and onion powder,\\n 9. 2 tablespoons pepper sauce,\\n 10. 2 tablespoons soy sauce,\\n 11. vegetable oil",,
      "steps": "Make sure the bitter leaves are well washed to remove the bitter taste. If the bitterness cannot be completely washed off, boil it for about 15 minutes and wash in cold water, Wash ad cock teh cocoyam till they are soft.Remove the peels and use a mortar and pestle to pound the cocoyams to a smooth paste, Boil the assorted beef, stock fish and dry fish in 1 litre of water till they are well done, Add the 3 stock cubes(Maggi/knorr) and cock for 5 minutes, Add the group crayfish, pepper and bitter leaves and cock for 10 minutes, Add the cocoyam paste in small lumps and the palm oil, Cover the pot and let it cock until the cocoyam lumps have dissolved. You can add water if you feel the soup is too thick, Add salt to taste and cock for a few minutes. The soup is ready",
      "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843599/onugbu-soup.jpg",
      "videoLink": "url of video"
    }

]