 {
    "id": "40",
    "state": "Benin-City, Edo",
    "name": "Owo Soup",
    "description": "You haven't been to Edo state if you've not tried their traditional owo soup. It is the oldest prepared and eaten soup of the edo people. It is usually thick and bare compared to other Nigerian soups. To prepare this delicious delicacy, the following ingredients are required.",
    "ingredients": "1. Dried or smoked fish, 2. Goat meat or assorted meat, 3. Cray fish, 4. 1 handful of dried prawns, 5. Fresh or dried pepper, 6. potash, 7. 1 onion bulb, 8. 5 fresh tomatoes, 9. 1 seasoning cube, salt",
    "steps": "1. wash and add the meat to a pot, 2. Add the chopped onion, seasoning cube and salt to taste. Allow to boil for 3 minutes, 3. Add the smoked fish, blended tomatoes, pepper and crayfish into the pot. Allow this to boil for 10 minutes, Stir continuously to avoid burning, 4. Add the potash into a bowl of boiling water to dissolve, 5. Strain and carefully add the liquid into the pot. Leave to cook for a few minutes, 6. Add the palm oil and allow to cook then stir. Note that the addition of the potash is what gives the soup it's thickness, 7. Finally, serve with any swallow of your choice.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843588/owo-soup.jpg",
    "videoLink": "https://youtu.be/txx_GTJWf0A"
  },
  {
    "id": "41",
    "state": "General",
    "name": "Special Okra Soup",
    "description": "This Okra Soup recipe is the most concentrated Okra Soup ever. It is meant for only licking! Yes, we say you lick the soup when we “eat” just the soup. That means no need for a fufu meal. The soup is that conc, with lots of vitamins. This is best for those who want to reduce or maintain their weight.",
    "ingredients": "1. 500g okra, 2. 1.2kg beef, 3. 2 medium smoked mackerels (titus fish), 4. 1 sweet pepper, 5. 10 mushrooms(optional), 6. ¼ cup palm oil, 7. Leafy vegetable (ugu or spinach), 8. 1 big bulb of red onion, 9. 2 seasoning cubes",
    "steps": "1. Debone the fish and break them up into big chunks., 2. Rinse and prep the okra by hand-cutting it, 3. Chop the peppers and onions, 4. Slice up the mushrooms (if available), 5. Boil the beef with seasoning cubes (crushed) and half of the chopped onions, 6. Set the stock aside. The stock should be little by the time the beef is well done, 7. In a clean dry pot, fry the sliced mushrooms with the palm oil,Fry for at most 5 minutes then take out the mushrooms, 8. Stir-fry the diced okra and remaining onions in the oil for a bit. Do not over-fry, 9. Start adding the meat stock bit by bit, 10. stir till you notice the elasticity of the okra coming through. Repeat till all the stock is used up, 11. Add the rest of the ingredients into the pot with the leafy vegetable on top, 12. Cover and steam till the leafy vegetables at the top wilts from the heat, 13. Stir till everything is well combined then add salt to your taste and mix well, The Okra Soup should be VERY thick when done.",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843582/okro-soup.jpg",
    "videoLink": "https://youtu.be/g-FoiBNDVg8"
  },
  {
    "id": "42",
    "state": "General",
    "name": "stir-fry chicken spaghetti",
    "description": " just when you thought spaghetti couldn't get any better, it did. This dish is finger-licking good and would have you coming back for more. So if you're thinking of spicing up your meal plan, you should definitely add this to the list.",
    "ingredients": "1. Boiled and drain chicken, 2. vegetable oil, 3. 1 bulb of onion, 4. Thyme and curry powder, 5. sliced green and red bell peppers, 2 each, 6. 1 seasoning cube, 7. A pack of thin spaghetti, 8. Salt to taste",
    "steps": "1. Add oil into a pan and allow to heat up, 2. Add chopped onion into the hot oil, Stir and Add the blended peppers, 3. Add thyme and curry powder, 4. Stir and add the sliced garlic and ginger, Cover and allow to dry, when it is dried, empty it into a bowl, 5. In the same pan, add your already boiled chicken, season and stir fry until it is well cooked, 6. while the chicken is stir-frying, add water into a pot, 7. Add salt to this boiling water, 8. Add spaghetti to the boiling water and allow to cook, 9. Add the vegetable(pepper) into the pan containing the chicken then add half a seasoning cube and mix together, 10. Drain the cooked spaghetti and add it into the stir-fry mixture, 11. Stir together properly, put off the heat and get ready to have a mouth watering meal",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591846315/spaghetti.jpg",
    "videoLink": "url of video"
  },
  {
    "id": "43",
    "state": "South Eastern Nigeria",
    "name": "Oha Soup",
    "description": "Oha soup is native to the Southern Eastern Nigeria.Oha soup is a traditional soup cooked with Ora leaves",
    "steps": "1. Grind the crayfish and pepper, 2. Wash and boil the cocoyam corm till its soft then remove the peels around the cocoyam, 3. Use a Mortar and pestle to pound the cocoyam to a smooth paste, 4. With a knife cut the Ora leaves into tiny pieces, 5. Get your stock fish and dry fish cut in smaller pieces, 6. Boil your stock fish and dry fish in  1 litre of water till they are done, 7. Wash and cut your meat then add to the pot and continue cooking, 8. When the meat is done, add 2 stock cubes and cook for 5 minutes, 9. Add pepper,group crayfish and ogiri, let it cook for another 10 minutes, 10. While the cooking add the cocoyam paste in small lumps, When your done adding the small lumps, 11. add palm oil, Let it cock until all the cocoyam lumps have dissolved., 12. (NOTE : you can add more water if you feel the soup is too thick, Add the Ora leaves, Add salt to your taste, cook for about 5 minutes, The soup is ready",
    "imageLink": "https://res.cloudinary.com/hngi7teamfierce/image/upload/v1591843588/oha-soup.jpg",
    "videoLink": "url of video"
  }
]
